Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0xd8b2 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  8
 <0><c>: Abbrev Number: 122 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x3ceb): GNU C11 13.3.0 -mlittle-endian -mgeneral-regs-only -mabi=lp64 -mbranch-protection=pac-ret+leaf -mstack-protector-guard=sysreg -mstack-protector-guard-reg=sp_el0 -mstack-protector-guard-offset=1400 -g -gdwarf-5 -Os -std=gnu11 -fno-strict-aliasing -fno-common -fshort-wchar -fno-PIE -fno-asynchronous-unwind-tables -fno-unwind-tables -fno-delete-null-pointer-checks -fno-allow-store-data-races -fstack-protector-strong -fno-omit-frame-pointer -fno-optimize-sibling-calls -fno-stack-clash-protection -fpatchable-function-entry=2 -fno-strict-overflow -fstack-check=no -fconserve-stack -fstack-protector-strong
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect line string, offset: 0): /home/geduer/ddd/day1/tsadc.c
    <16>   DW_AT_comp_dir    : (indirect line string, offset: 0x1e): /usr/src/linux-headers-6.1.115-hanyang-rk35xx
    <1a>   DW_AT_ranges      : 0xa8
    <1e>   DW_AT_low_pc      : 0
    <26>   DW_AT_stmt_list   : 0
 <1><2a>: Abbrev Number: 42 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 8
    <2c>   DW_AT_encoding    : 7	(unsigned)
    <2d>   DW_AT_name        : (indirect string, offset: 0x1a4): long unsigned int

 <1><210>: Abbrev Number: 11 (DW_TAG_typedef)
    <211>   DW_AT_name        : (indirect string, offset: 0x39db): __poll_t
    <215>   DW_AT_decl_file   : 18
    <216>   DW_AT_decl_line   : 55
    <217>   DW_AT_decl_column : 28
    <218>   DW_AT_type        : <0x5c>
 <1><21c>: Abbrev Number: 11 (DW_TAG_typedef)
    <21d>   DW_AT_name        : (indirect string, offset: 0x5293): __kernel_dev_t
    <221>   DW_AT_decl_file   : 19
    <222>   DW_AT_decl_line   : 13
    <223>   DW_AT_decl_column : 13
    <224>   DW_AT_type        : <0x127>
 <1><228>: Abbrev Number: 11 (DW_TAG_typedef)
    <229>   DW_AT_name        : (indirect string, offset: 0x7587): dev_t
    <22d>   DW_AT_decl_file   : 19
    <22e>   DW_AT_decl_line   : 16
    <22f>   DW_AT_decl_column : 25
    <230>   DW_AT_type        : <0x21c>
 <1><234>: Abbrev Number: 11 (DW_TAG_typedef)
    <235>   DW_AT_name        : (indirect string, offset: 0x52a): umode_t
    <239>   DW_AT_decl_file   : 19
    <23a>   DW_AT_decl_line   : 19
    <23b>   DW_AT_decl_column : 25
    <23c>   DW_AT_type        : <0xa6>
 <1><240>: Abbrev Number: 11 (DW_TAG_typedef)
    <241>   DW_AT_name        : (indirect string, offset: 0x65e0): pid_t
    <245>   DW_AT_decl_file   : 19
    <246>   DW_AT_decl_line   : 22
    <247>   DW_AT_decl_column : 25
    <248>   DW_AT_type        : <0x187>
 <1><24c>: Abbrev Number: 11 (DW_TAG_typedef)
    <24d>   DW_AT_name        : (indirect string, offset: 0x6143): clockid_t
    <251>   DW_AT_decl_file   : 19
    <252>   DW_AT_decl_line   : 27
    <253>   DW_AT_decl_column : 28
    <254>   DW_AT_type        : <0x1f3>
 <1><258>: Abbrev Number: 11 (DW_TAG_typedef)
    <259>   DW_AT_name        : (indirect string, offset: 0xdc9): bool
    <25d>   DW_AT_decl_file   : 19
    <25e>   DW_AT_decl_line   : 30
    <25f>   DW_AT_decl_column : 17
    <260>   DW_AT_type        : <0x264>
 <1><264>: Abbrev Number: 42 (DW_TAG_base_type)
    <265>   DW_AT_byte_size   : 1
    <266>   DW_AT_encoding    : 2	(boolean)
    <267>   DW_AT_name        : (indirect string, offset: 0x2930): _Bool
 <1><26b>: Abbrev Number: 11 (DW_TAG_typedef)
    <26c>   DW_AT_name        : (indirect string, offset: 0x49fe): uid_t
    <270>   DW_AT_decl_file   : 19
    <271>   DW_AT_decl_line   : 32
    <272>   DW_AT_decl_column : 26
    <273>   DW_AT_type        : <0x193>
 <1><277>: Abbrev Number: 11 (DW_TAG_typedef)
    <278>   DW_AT_name        : (indirect string, offset: 0x3468): gid_t
    <27c>   DW_AT_decl_file   : 19
    <27d>   DW_AT_decl_line   : 33
    <27e>   DW_AT_decl_column : 26
    <27f>   DW_AT_type        : <0x19f>
 <1><283>: Abbrev Number: 11 (DW_TAG_typedef)
    <284>   DW_AT_name        : (indirect string, offset: 0x40f): uintptr_t
    <288>   DW_AT_decl_file   : 19
    <289>   DW_AT_decl_line   : 37
    <28a>   DW_AT_decl_column : 24
    <28b>   DW_AT_type        : <0x2a>
 <1><28f>: Abbrev Number: 11 (DW_TAG_typedef)
    <290>   DW_AT_name        : (indirect string, offset: 0x69d): loff_t
    <294>   DW_AT_decl_file   : 19
    <295>   DW_AT_decl_line   : 46
    <296>   DW_AT_decl_column : 26
    <297>   DW_AT_type        : <0x1c3>
 <1><29b>: Abbrev Number: 11 (DW_TAG_typedef)
    <29c>   DW_AT_name        : (indirect string, offset: 0x10dd): size_t
    <2a0>   DW_AT_decl_file   : 19
    <2a1>   DW_AT_decl_line   : 55
    <2a2>   DW_AT_decl_column : 26
    <2a3>   DW_AT_type        : <0x1ab>
 <1><2a7>: Abbrev Number: 11 (DW_TAG_typedef)
    <2a8>   DW_AT_name        : (indirect string, offset: 0x7571): ssize_t
    <2ac>   DW_AT_decl_file   : 19
    <2ad>   DW_AT_decl_line   : 60
    <2ae>   DW_AT_decl_column : 26
    <2af>   DW_AT_type        : <0x1b7>
 <1><2b3>: Abbrev Number: 11 (DW_TAG_typedef)
    <2b4>   DW_AT_name        : (indirect string, offset: 0x762a): int32_t
    <2b8>   DW_AT_decl_file   : 19
    <2b9>   DW_AT_decl_line   : 98
    <2ba>   DW_AT_decl_column : 15
    <2bb>   DW_AT_type        : <0x118>
 <1><2bf>: Abbrev Number: 11 (DW_TAG_typedef)
    <2c0>   DW_AT_name        : (indirect string, offset: 0x940): uint32_t
    <2c4>   DW_AT_decl_file   : 19
    <2c5>   DW_AT_decl_line   : 104
    <2c6>   DW_AT_decl_column : 15
    <2c7>   DW_AT_type        : <0x127>
 <1><2cb>: Abbrev Number: 11 (DW_TAG_typedef)
    <2cc>   DW_AT_name        : (indirect string, offset: 0x4e8a): sector_t
    <2d0>   DW_AT_decl_file   : 19
    <2d1>   DW_AT_decl_line   : 125
    <2d2>   DW_AT_decl_column : 13
    <2d3>   DW_AT_type        : <0x13b>
 <1><2d7>: Abbrev Number: 11 (DW_TAG_typedef)
    <2d8>   DW_AT_name        : (indirect string, offset: 0x4e01): blkcnt_t
    <2dc>   DW_AT_decl_file   : 19
    <2dd>   DW_AT_decl_line   : 126
    <2de>   DW_AT_decl_column : 13
    <2df>   DW_AT_type        : <0x13b>
 <1><2e3>: Abbrev Number: 11 (DW_TAG_typedef)
    <2e4>   DW_AT_name        : (indirect string, offset: 0x69b9): gfp_t
    <2e8>   DW_AT_decl_file   : 19
    <2e9>   DW_AT_decl_line   : 148
    <2ea>   DW_AT_decl_column : 32
    <2eb>   DW_AT_type        : <0x5c>
 <1><2ef>: Abbrev Number: 11 (DW_TAG_typedef)
    <2f0>   DW_AT_name        : (indirect string, offset: 0x2635): fmode_t
    <2f4>   DW_AT_decl_file   : 19
    <2f5>   DW_AT_decl_line   : 150
    <2f6>   DW_AT_decl_column : 32
    <2f7>   DW_AT_type        : <0x5c>
 <1><2fb>: Abbrev Number: 11 (DW_TAG_typedef)
    <2fc>   DW_AT_name        : (indirect string, offset: 0x3c0a): phys_addr_t
    <300>   DW_AT_decl_file   : 19
    <301>   DW_AT_decl_line   : 153
    <302>   DW_AT_decl_column : 13
    <303>   DW_AT_type        : <0x13b>
 <1><307>: Abbrev Number: 20 (DW_TAG_structure_type)
    <308>   DW_AT_byte_size   : 4
    <309>   DW_AT_decl_file   : 19
    <30a>   DW_AT_decl_line   : 166
    <30b>   DW_AT_decl_column : 9
    <30c>   DW_AT_sibling     : <0x31e>
 <2><310>: Abbrev Number: 1 (DW_TAG_member)
    <311>   DW_AT_name        : (indirect string, offset: 0x484e): counter
    <315>   DW_AT_decl_file   : 19
    <316>   DW_AT_decl_line   : 167
    <317>   DW_AT_decl_column : 6
    <318>   DW_AT_type        : <0xb9>
    <31c>   DW_AT_data_member_location: 0
 <2><31d>: Abbrev Number: 0
 <1><31e>: Abbrev Number: 11 (DW_TAG_typedef)
    <31f>   DW_AT_name        : (indirect string, offset: 0x4280): atomic_t
    <323>   DW_AT_decl_file   : 19
    <324>   DW_AT_decl_line   : 168
    <325>   DW_AT_decl_column : 3
    <326>   DW_AT_type        : <0x307>
 <1><32a>: Abbrev Number: 20 (DW_TAG_structure_type)
    <32b>   DW_AT_byte_size   : 8
    <32c>   DW_AT_decl_file   : 19
    <32d>   DW_AT_decl_line   : 173
    <32e>   DW_AT_decl_column : 9
    <32f>   DW_AT_sibling     : <0x341>
 <2><333>: Abbrev Number: 1 (DW_TAG_member)
    <334>   DW_AT_name        : (indirect string, offset: 0x484e): counter
    <338>   DW_AT_decl_file   : 19
    <339>   DW_AT_decl_line   : 174
    <33a>   DW_AT_decl_column : 6
    <33b>   DW_AT_type        : <0x131>
    <33f>   DW_AT_data_member_location: 0
 <2><340>: Abbrev Number: 0
 <1><341>: Abbrev Number: 11 (DW_TAG_typedef)
    <342>   DW_AT_name        : (indirect string, offset: 0x5f53): atomic64_t
    <346>   DW_AT_decl_file   : 19
    <347>   DW_AT_decl_line   : 175
    <348>   DW_AT_decl_column : 3
    <349>   DW_AT_type        : <0x32a>
 <1><34d>: Abbrev Number: 8 (DW_TAG_structure_type)
    <34e>   DW_AT_name        : (indirect string, offset: 0x488d): list_head
    <352>   DW_AT_byte_size   : 16
    <353>   DW_AT_decl_file   : 19
    <354>   DW_AT_decl_line   : 178
    <355>   DW_AT_decl_column : 8
    <356>   DW_AT_sibling     : <0x375>
 <2><35a>: Abbrev Number: 1 (DW_TAG_member)
    <35b>   DW_AT_name        : (indirect string, offset: 0x280d): next
    <35f>   DW_AT_decl_file   : 19
    <360>   DW_AT_decl_line   : 179
    <361>   DW_AT_decl_column : 20
    <362>   DW_AT_type        : <0x375>
    <366>   DW_AT_data_member_location: 0
 <2><367>: Abbrev Number: 1 (DW_TAG_member)
    <368>   DW_AT_name        : (indirect string, offset: 0x5b2e): prev
    <36c>   DW_AT_decl_file   : 19
    <36d>   DW_AT_decl_line   : 179
    <36e>   DW_AT_decl_column : 27
    <36f>   DW_AT_type        : <0x375>
    <373>   DW_AT_data_member_location: 8
 <2><374>: Abbrev Number: 0
 <1><375>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <376>   DW_AT_byte_size   : 8
    <376>   DW_AT_type        : <0x34d>
 <1><37a>: Abbrev Number: 8 (DW_TAG_structure_type)
    <37b>   DW_AT_name        : (indirect string, offset: 0x78a6): hlist_head
    <37f>   DW_AT_byte_size   : 8
    <380>   DW_AT_decl_file   : 19
    <381>   DW_AT_decl_line   : 182
    <382>   DW_AT_decl_column : 8
    <383>   DW_AT_sibling     : <0x395>
 <2><387>: Abbrev Number: 1 (DW_TAG_member)
    <388>   DW_AT_name        : (indirect string, offset: 0xf80): first
    <38c>   DW_AT_decl_file   : 19
    <38d>   DW_AT_decl_line   : 183
    <38e>   DW_AT_decl_column : 21
    <38f>   DW_AT_type        : <0x3bd>
    <393>   DW_AT_data_member_location: 0
 <2><394>: Abbrev Number: 0
 <1><395>: Abbrev Number: 8 (DW_TAG_structure_type)
    <396>   DW_AT_name        : (indirect string, offset: 0x63df): hlist_node
    <39a>   DW_AT_byte_size   : 16
    <39b>   DW_AT_decl_file   : 19
    <39c>   DW_AT_decl_line   : 186
    <39d>   DW_AT_decl_column : 8
    <39e>   DW_AT_sibling     : <0x3bd>
 <2><3a2>: Abbrev Number: 1 (DW_TAG_member)
    <3a3>   DW_AT_name        : (indirect string, offset: 0x280d): next
    <3a7>   DW_AT_decl_file   : 19
    <3a8>   DW_AT_decl_line   : 187
    <3a9>   DW_AT_decl_column : 21
    <3aa>   DW_AT_type        : <0x3bd>
    <3ae>   DW_AT_data_member_location: 0
 <2><3af>: Abbrev Number: 1 (DW_TAG_member)
    <3b0>   DW_AT_name        : (indirect string, offset: 0x48cb): pprev
    <3b4>   DW_AT_decl_file   : 19
    <3b5>   DW_AT_decl_line   : 187
    <3b6>   DW_AT_decl_column : 29
    <3b7>   DW_AT_type        : <0x3c2>
    <3bb>   DW_AT_data_member_location: 8
 <2><3bc>: Abbrev Number: 0
 <1><3bd>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <3be>   DW_AT_byte_size   : 8
    <3be>   DW_AT_type        : <0x395>
 <1><3c2>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <3c3>   DW_AT_byte_size   : 8
    <3c3>   DW_AT_type        : <0x3bd>
 <1><3c7>: Abbrev Number: 17 (DW_TAG_array_type)
    <3c8>   DW_AT_type        : <0x50>
    <3cc>   DW_AT_sibling     : <0x3d7>
 <2><3d0>: Abbrev Number: 18 (DW_TAG_subrange_type)
    <3d1>   DW_AT_type        : <0x2a>
    <3d5>   DW_AT_upper_bound : 5
 <2><3d6>: Abbrev Number: 0
 <1><3d7>: Abbrev Number: 27 (DW_TAG_structure_type)
    <3d8>   DW_AT_name        : (indirect string, offset: 0x13b8): callback_head
    <3dc>   DW_AT_byte_size   : 16
    <3dd>   DW_AT_alignment   : 8
    <3de>   DW_AT_decl_file   : 19
    <3df>   DW_AT_decl_line   : 220
    <3e0>   DW_AT_decl_column : 8
    <3e0>   DW_AT_sibling     : <0x3ff>
 <2><3e4>: Abbrev Number: 1 (DW_TAG_member)
    <3e5>   DW_AT_name        : (indirect string, offset: 0x280d): next
    <3e9>   DW_AT_decl_file   : 19
    <3ea>   DW_AT_decl_line   : 221
    <3eb>   DW_AT_decl_column : 24
    <3ec>   DW_AT_type        : <0x3ff>
    <3f0>   DW_AT_data_member_location: 0
 <2><3f1>: Abbrev Number: 1 (DW_TAG_member)
    <3f2>   DW_AT_name        : (indirect string, offset: 0x2031): func
    <3f6>   DW_AT_decl_file   : 19
    <3f7>   DW_AT_decl_line   : 222
    <3f8>   DW_AT_decl_column : 9
    <3f9>   DW_AT_type        : <0x40f>
    <3fd>   DW_AT_data_member_location: 8
 <2><3fe>: Abbrev Number: 0
 <1><3ff>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <400>   DW_AT_byte_size   : 8
    <400>   DW_AT_type        : <0x3d7>
 <1><404>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <405>   DW_AT_prototyped  : 1
    <405>   DW_AT_sibling     : <0x40f>
 <2><409>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <40a>   DW_AT_type        : <0x3ff>
 <2><40e>: Abbrev Number: 0
 <1><40f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <410>   DW_AT_byte_size   : 8
    <410>   DW_AT_type        : <0x404>
 <1><414>: Abbrev Number: 124 (DW_TAG_pointer_type)
    <415>   DW_AT_byte_size   : 8
 <1><416>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <417>   DW_AT_byte_size   : 8
    <417>   DW_AT_type        : <0x41b>
 <1><41b>: Abbrev Number: 125 (DW_TAG_const_type)
 <1><41c>: Abbrev Number: 106 (DW_TAG_volatile_type)
    <41d>   DW_AT_type        : <0x41b>
 <1><421>: Abbrev Number: 44 (DW_TAG_structure_type)
    <422>   DW_AT_name        : (indirect string, offset: 0x1ede): module
    <426>   DW_AT_byte_size   : 960
    <428>   DW_AT_alignment   : 64
    <429>   DW_AT_decl_file   : 20
    <42a>   DW_AT_decl_line   : 363
    <42c>   DW_AT_decl_column : 8
    <42c>   DW_AT_sibling     : <0x7e6>
 <2><430>: Abbrev Number: 2 (DW_TAG_member)
    <431>   DW_AT_name        : (indirect string, offset: 0x58c1): state
    <435>   DW_AT_decl_file   : 20
    <436>   DW_AT_decl_line   : 364
    <438>   DW_AT_decl_column : 20
    <439>   DW_AT_type        : <0x9c56>
    <43d>   DW_AT_data_member_location: 0
 <2><43e>: Abbrev Number: 2 (DW_TAG_member)
    <43f>   DW_AT_name        : (indirect string, offset: 0x59c): list
    <443>   DW_AT_decl_file   : 20
    <444>   DW_AT_decl_line   : 367
    <446>   DW_AT_decl_column : 19
    <447>   DW_AT_type        : <0x34d>
    <44b>   DW_AT_data_member_location: 8
 <2><44c>: Abbrev Number: 2 (DW_TAG_member)
    <44d>   DW_AT_name        : (indirect string, offset: 0x5b4): name
    <451>   DW_AT_decl_file   : 20
    <452>   DW_AT_decl_line   : 370
    <454>   DW_AT_decl_column : 7
    <455>   DW_AT_type        : <0x9b0e>
    <459>   DW_AT_data_member_location: 24
 <2><45a>: Abbrev Number: 2 (DW_TAG_member)
    <45b>   DW_AT_name        : (indirect string, offset: 0x68af): mkobj
    <45f>   DW_AT_decl_file   : 20
    <460>   DW_AT_decl_line   : 378
    <462>   DW_AT_decl_column : 24
    <463>   DW_AT_type        : <0x9b1e>
    <467>   DW_AT_data_member_location: 80
 <2><468>: Abbrev Number: 2 (DW_TAG_member)
    <469>   DW_AT_name        : (indirect string, offset: 0x482b): modinfo_attrs
    <46d>   DW_AT_decl_file   : 20
    <46e>   DW_AT_decl_line   : 379
    <470>   DW_AT_decl_column : 27
    <471>   DW_AT_type        : <0x9beb>
    <475>   DW_AT_data_member_location: 176
 <2><476>: Abbrev Number: 2 (DW_TAG_member)
    <477>   DW_AT_name        : (indirect string, offset: 0x288): version
    <47b>   DW_AT_decl_file   : 20
    <47c>   DW_AT_decl_line   : 380
    <47e>   DW_AT_decl_column : 14
    <47f>   DW_AT_type        : <0x4b>
    <483>   DW_AT_data_member_location: 184
 <2><484>: Abbrev Number: 2 (DW_TAG_member)
    <485>   DW_AT_name        : (indirect string, offset: 0x1337): srcversion
    <489>   DW_AT_decl_file   : 20
    <48a>   DW_AT_decl_line   : 381
    <48c>   DW_AT_decl_column : 14
    <48d>   DW_AT_type        : <0x4b>
    <491>   DW_AT_data_member_location: 192
 <2><492>: Abbrev Number: 2 (DW_TAG_member)
    <493>   DW_AT_name        : (indirect string, offset: 0x4627): holders_dir
    <497>   DW_AT_decl_file   : 20
    <498>   DW_AT_decl_line   : 382
    <49a>   DW_AT_decl_column : 18
    <49b>   DW_AT_type        : <0x8ee9>
    <49f>   DW_AT_data_member_location: 200
 <2><4a0>: Abbrev Number: 2 (DW_TAG_member)
    <4a1>   DW_AT_name        : (indirect string, offset: 0x6187): syms
    <4a5>   DW_AT_decl_file   : 20
    <4a6>   DW_AT_decl_line   : 385
    <4a8>   DW_AT_decl_column : 30
    <4a9>   DW_AT_type        : <0x9d5b>
    <4ad>   DW_AT_data_member_location: 208
 <2><4ae>: Abbrev Number: 2 (DW_TAG_member)
    <4af>   DW_AT_name        : (indirect string, offset: 0x2cee): crcs
    <4b3>   DW_AT_decl_file   : 20
    <4b4>   DW_AT_decl_line   : 386
    <4b6>   DW_AT_decl_column : 13
    <4b7>   DW_AT_type        : <0x9d60>
    <4bb>   DW_AT_data_member_location: 216
 <2><4bc>: Abbrev Number: 2 (DW_TAG_member)
    <4bd>   DW_AT_name        : (indirect string, offset: 0x4bba): num_syms
    <4c1>   DW_AT_decl_file   : 20
    <4c2>   DW_AT_decl_line   : 387
    <4c4>   DW_AT_decl_column : 15
    <4c5>   DW_AT_type        : <0x5c>
    <4c9>   DW_AT_data_member_location: 224
 <2><4ca>: Abbrev Number: 2 (DW_TAG_member)
    <4cb>   DW_AT_name        : (indirect string, offset: 0x27d): param_lock
    <4cf>   DW_AT_decl_file   : 20
    <4d0>   DW_AT_decl_line   : 396
    <4d2>   DW_AT_decl_column : 15
    <4d3>   DW_AT_type        : <0x255c>
    <4d7>   DW_AT_data_member_location: 232
 <2><4d8>: Abbrev Number: 46 (DW_TAG_member)
    <4d9>   DW_AT_name        : kp
    <4dc>   DW_AT_decl_file   : 20
    <4dd>   DW_AT_decl_line   : 398
    <4df>   DW_AT_decl_column : 23
    <4e0>   DW_AT_type        : <0x9d65>
    <4e4>   DW_AT_data_member_location: 288
 <2><4e6>: Abbrev Number: 5 (DW_TAG_member)
    <4e7>   DW_AT_name        : (indirect string, offset: 0x6c56): num_kp
    <4eb>   DW_AT_decl_file   : 20
    <4ec>   DW_AT_decl_line   : 399
    <4ee>   DW_AT_decl_column : 15
    <4ef>   DW_AT_type        : <0x5c>
    <4f3>   DW_AT_data_member_location: 296
 <2><4f5>: Abbrev Number: 5 (DW_TAG_member)
    <4f6>   DW_AT_name        : (indirect string, offset: 0x5709): num_gpl_syms
    <4fa>   DW_AT_decl_file   : 20
    <4fb>   DW_AT_decl_line   : 402
    <4fd>   DW_AT_decl_column : 15
    <4fe>   DW_AT_type        : <0x5c>
    <502>   DW_AT_data_member_location: 300
 <2><504>: Abbrev Number: 5 (DW_TAG_member)
    <505>   DW_AT_name        : (indirect string, offset: 0x627b): gpl_syms
    <509>   DW_AT_decl_file   : 20
    <50a>   DW_AT_decl_line   : 403
    <50c>   DW_AT_decl_column : 30
    <50d>   DW_AT_type        : <0x9d5b>
    <511>   DW_AT_data_member_location: 304
 <2><513>: Abbrev Number: 5 (DW_TAG_member)
    <514>   DW_AT_name        : (indirect string, offset: 0x2ce5): gpl_crcs
    <518>   DW_AT_decl_file   : 20
    <519>   DW_AT_decl_line   : 404
    <51b>   DW_AT_decl_column : 13
    <51c>   DW_AT_type        : <0x9d60>
    <520>   DW_AT_data_member_location: 312
 <2><522>: Abbrev Number: 5 (DW_TAG_member)
    <523>   DW_AT_name        : (indirect string, offset: 0x6063): using_gplonly_symbols
    <527>   DW_AT_decl_file   : 20
    <528>   DW_AT_decl_line   : 405
    <52a>   DW_AT_decl_column : 7
    <52b>   DW_AT_type        : <0x258>
    <52f>   DW_AT_data_member_location: 320
 <2><531>: Abbrev Number: 5 (DW_TAG_member)
    <532>   DW_AT_name        : (indirect string, offset: 0x649): async_probe_requested
    <536>   DW_AT_decl_file   : 20
    <537>   DW_AT_decl_line   : 412
    <539>   DW_AT_decl_column : 7
    <53a>   DW_AT_type        : <0x258>
    <53e>   DW_AT_data_member_location: 321
 <2><540>: Abbrev Number: 5 (DW_TAG_member)
    <541>   DW_AT_name        : (indirect string, offset: 0x35e6): num_exentries
    <545>   DW_AT_decl_file   : 20
    <546>   DW_AT_decl_line   : 415
    <548>   DW_AT_decl_column : 15
    <549>   DW_AT_type        : <0x5c>
    <54d>   DW_AT_data_member_location: 324
 <2><54f>: Abbrev Number: 5 (DW_TAG_member)
    <550>   DW_AT_name        : (indirect string, offset: 0x6e9c): extable
    <554>   DW_AT_decl_file   : 20
    <555>   DW_AT_decl_line   : 416
    <557>   DW_AT_decl_column : 32
    <558>   DW_AT_type        : <0x9d6a>
    <55c>   DW_AT_data_member_location: 328
 <2><55e>: Abbrev Number: 5 (DW_TAG_member)
    <55f>   DW_AT_name        : (indirect string, offset: 0x42e1): init
    <563>   DW_AT_decl_file   : 20
    <564>   DW_AT_decl_line   : 419
    <566>   DW_AT_decl_column : 8
    <567>   DW_AT_type        : <0x82c>
    <56b>   DW_AT_data_member_location: 336
 <2><56d>: Abbrev Number: 57 (DW_TAG_member)
    <56e>   DW_AT_name        : (indirect string, offset: 0x3294): core_layout
    <572>   DW_AT_decl_file   : 20
    <573>   DW_AT_decl_line   : 422
    <575>   DW_AT_decl_column : 23
    <576>   DW_AT_type        : <0x9cab>
    <57a>   DW_AT_alignment   : 64
    <57b>   DW_AT_data_member_location: 384
 <2><57d>: Abbrev Number: 57 (DW_TAG_member)
    <57e>   DW_AT_name        : (indirect string, offset: 0x3402): init_layout
    <582>   DW_AT_decl_file   : 20
    <583>   DW_AT_decl_line   : 423
    <585>   DW_AT_decl_column : 23
    <586>   DW_AT_type        : <0x9cab>
    <58a>   DW_AT_alignment   : 8
    <58b>   DW_AT_data_member_location: 464
 <2><58d>: Abbrev Number: 5 (DW_TAG_member)
    <58e>   DW_AT_name        : (indirect string, offset: 0x71b5): arch
    <592>   DW_AT_decl_file   : 20
    <593>   DW_AT_decl_line   : 429
    <595>   DW_AT_decl_column : 27
    <596>   DW_AT_type        : <0x9aa0>
    <59a>   DW_AT_data_member_location: 544
 <2><59c>: Abbrev Number: 5 (DW_TAG_member)
    <59d>   DW_AT_name        : (indirect string, offset: 0xd9c): taints
    <5a1>   DW_AT_decl_file   : 20
    <5a2>   DW_AT_decl_line   : 431
    <5a4>   DW_AT_decl_column : 16
    <5a5>   DW_AT_type        : <0x2a>
    <5a9>   DW_AT_data_member_location: 576
 <2><5ab>: Abbrev Number: 5 (DW_TAG_member)
    <5ac>   DW_AT_name        : (indirect string, offset: 0x11be): num_bugs
    <5b0>   DW_AT_decl_file   : 20
    <5b1>   DW_AT_decl_line   : 435
    <5b3>   DW_AT_decl_column : 11
    <5b4>   DW_AT_type        : <0x5c>
    <5b8>   DW_AT_data_member_location: 584
 <2><5ba>: Abbrev Number: 5 (DW_TAG_member)
    <5bb>   DW_AT_name        : (indirect string, offset: 0x556a): bug_list
    <5bf>   DW_AT_decl_file   : 20
    <5c0>   DW_AT_decl_line   : 436
    <5c2>   DW_AT_decl_column : 19
    <5c3>   DW_AT_type        : <0x34d>
    <5c7>   DW_AT_data_member_location: 592
 <2><5c9>: Abbrev Number: 5 (DW_TAG_member)
    <5ca>   DW_AT_name        : (indirect string, offset: 0x7015): bug_table
    <5ce>   DW_AT_decl_file   : 20
    <5cf>   DW_AT_decl_line   : 437
    <5d1>   DW_AT_decl_column : 20
    <5d2>   DW_AT_type        : <0x9d6f>
    <5d6>   DW_AT_data_member_location: 608
 <2><5d8>: Abbrev Number: 5 (DW_TAG_member)
    <5d9>   DW_AT_name        : (indirect string, offset: 0x15fe): kallsyms
    <5dd>   DW_AT_decl_file   : 20
    <5de>   DW_AT_decl_line   : 442
    <5e0>   DW_AT_decl_column : 29
    <5e1>   DW_AT_type        : <0x9d74>
    <5e5>   DW_AT_data_member_location: 616
 <2><5e7>: Abbrev Number: 5 (DW_TAG_member)
    <5e8>   DW_AT_name        : (indirect string, offset: 0x45f0): core_kallsyms
    <5ec>   DW_AT_decl_file   : 20
    <5ed>   DW_AT_decl_line   : 443
    <5ef>   DW_AT_decl_column : 22
    <5f0>   DW_AT_type        : <0x9d0f>
    <5f4>   DW_AT_data_member_location: 624
 <2><5f6>: Abbrev Number: 5 (DW_TAG_member)
    <5f7>   DW_AT_name        : (indirect string, offset: 0x57ec): sect_attrs
    <5fb>   DW_AT_decl_file   : 20
    <5fc>   DW_AT_decl_line   : 446
    <5fe>   DW_AT_decl_column : 28
    <5ff>   DW_AT_type        : <0x9d7e>
    <603>   DW_AT_data_member_location: 656
 <2><605>: Abbrev Number: 5 (DW_TAG_member)
    <606>   DW_AT_name        : (indirect string, offset: 0x769a): notes_attrs
    <60a>   DW_AT_decl_file   : 20
    <60b>   DW_AT_decl_line   : 449
    <60d>   DW_AT_decl_column : 29
    <60e>   DW_AT_type        : <0x9d88>
    <612>   DW_AT_data_member_location: 664
 <2><614>: Abbrev Number: 5 (DW_TAG_member)
    <615>   DW_AT_name        : (indirect string, offset: 0x7582): args
    <619>   DW_AT_decl_file   : 20
    <61a>   DW_AT_decl_line   : 454
    <61c>   DW_AT_decl_column : 8
    <61d>   DW_AT_type        : <0x1ff>
    <621>   DW_AT_data_member_location: 672
 <2><623>: Abbrev Number: 5 (DW_TAG_member)
    <624>   DW_AT_name        : (indirect string, offset: 0x6b91): percpu
    <628>   DW_AT_decl_file   : 20
    <629>   DW_AT_decl_line   : 458
    <62b>   DW_AT_decl_column : 17
    <62c>   DW_AT_type        : <0x414>
    <630>   DW_AT_data_member_location: 680
 <2><632>: Abbrev Number: 5 (DW_TAG_member)
    <633>   DW_AT_name        : (indirect string, offset: 0x38fb): percpu_size
    <637>   DW_AT_decl_file   : 20
    <638>   DW_AT_decl_line   : 459
    <63a>   DW_AT_decl_column : 15
    <63b>   DW_AT_type        : <0x5c>
    <63f>   DW_AT_data_member_location: 688
 <2><641>: Abbrev Number: 5 (DW_TAG_member)
    <642>   DW_AT_name        : (indirect string, offset: 0x2b77): noinstr_text_start
    <646>   DW_AT_decl_file   : 20
    <647>   DW_AT_decl_line   : 461
    <649>   DW_AT_decl_column : 8
    <64a>   DW_AT_type        : <0x414>
    <64e>   DW_AT_data_member_location: 696
 <2><650>: Abbrev Number: 5 (DW_TAG_member)
    <651>   DW_AT_name        : (indirect string, offset: 0x6d59): noinstr_text_size
    <655>   DW_AT_decl_file   : 20
    <656>   DW_AT_decl_line   : 462
    <658>   DW_AT_decl_column : 15
    <659>   DW_AT_type        : <0x5c>
    <65d>   DW_AT_data_member_location: 704
 <2><65f>: Abbrev Number: 5 (DW_TAG_member)
    <660>   DW_AT_name        : (indirect string, offset: 0x5d52): num_tracepoints
    <664>   DW_AT_decl_file   : 20
    <665>   DW_AT_decl_line   : 465
    <667>   DW_AT_decl_column : 15
    <668>   DW_AT_type        : <0x5c>
    <66c>   DW_AT_data_member_location: 708
 <2><66e>: Abbrev Number: 5 (DW_TAG_member)
    <66f>   DW_AT_name        : (indirect string, offset: 0x506c): tracepoints_ptrs
    <673>   DW_AT_decl_file   : 20
    <674>   DW_AT_decl_line   : 466
    <676>   DW_AT_decl_column : 20
    <677>   DW_AT_type        : <0x9d8d>
    <67b>   DW_AT_data_member_location: 712
 <2><67d>: Abbrev Number: 5 (DW_TAG_member)
    <67e>   DW_AT_name        : (indirect string, offset: 0x4726): num_srcu_structs
    <682>   DW_AT_decl_file   : 20
    <683>   DW_AT_decl_line   : 469
    <685>   DW_AT_decl_column : 15
    <686>   DW_AT_type        : <0x5c>
    <68a>   DW_AT_data_member_location: 720
 <2><68c>: Abbrev Number: 5 (DW_TAG_member)
    <68d>   DW_AT_name        : (indirect string, offset: 0x6776): srcu_struct_ptrs
    <691>   DW_AT_decl_file   : 20
    <692>   DW_AT_decl_line   : 470
    <694>   DW_AT_decl_column : 23
    <695>   DW_AT_type        : <0x9d92>
    <699>   DW_AT_data_member_location: 728
 <2><69b>: Abbrev Number: 5 (DW_TAG_member)
    <69c>   DW_AT_name        : (indirect string, offset: 0x130d): num_bpf_raw_events
    <6a0>   DW_AT_decl_file   : 20
    <6a1>   DW_AT_decl_line   : 473
    <6a3>   DW_AT_decl_column : 15
    <6a4>   DW_AT_type        : <0x5c>
    <6a8>   DW_AT_data_member_location: 736
 <2><6aa>: Abbrev Number: 5 (DW_TAG_member)
    <6ab>   DW_AT_name        : (indirect string, offset: 0x4a15): bpf_raw_events
    <6af>   DW_AT_decl_file   : 20
    <6b0>   DW_AT_decl_line   : 474
    <6b2>   DW_AT_decl_column : 28
    <6b3>   DW_AT_type        : <0x9d97>
    <6b7>   DW_AT_data_member_location: 744
 <2><6b9>: Abbrev Number: 5 (DW_TAG_member)
    <6ba>   DW_AT_name        : (indirect string, offset: 0x50a5): btf_data_size
    <6be>   DW_AT_decl_file   : 20
    <6bf>   DW_AT_decl_line   : 477
    <6c1>   DW_AT_decl_column : 15
    <6c2>   DW_AT_type        : <0x5c>
    <6c6>   DW_AT_data_member_location: 752
 <2><6c8>: Abbrev Number: 5 (DW_TAG_member)
    <6c9>   DW_AT_name        : (indirect string, offset: 0x4e6): btf_base_data_size
    <6cd>   DW_AT_decl_file   : 20
    <6ce>   DW_AT_decl_line   : 478
    <6d0>   DW_AT_decl_column : 15
    <6d1>   DW_AT_type        : <0x5c>
    <6d5>   DW_AT_data_member_location: 756
 <2><6d7>: Abbrev Number: 5 (DW_TAG_member)
    <6d8>   DW_AT_name        : (indirect string, offset: 0x2849): btf_data
    <6dc>   DW_AT_decl_file   : 20
    <6dd>   DW_AT_decl_line   : 479
    <6df>   DW_AT_decl_column : 8
    <6e0>   DW_AT_type        : <0x414>
    <6e4>   DW_AT_data_member_location: 760
 <2><6e6>: Abbrev Number: 5 (DW_TAG_member)
    <6e7>   DW_AT_name        : (indirect string, offset: 0x7334): btf_base_data
    <6eb>   DW_AT_decl_file   : 20
    <6ec>   DW_AT_decl_line   : 480
    <6ee>   DW_AT_decl_column : 8
    <6ef>   DW_AT_type        : <0x414>
    <6f3>   DW_AT_data_member_location: 768
 <2><6f5>: Abbrev Number: 5 (DW_TAG_member)
    <6f6>   DW_AT_name        : (indirect string, offset: 0x1276): num_trace_bprintk_fmt
    <6fa>   DW_AT_decl_file   : 20
    <6fb>   DW_AT_decl_line   : 487
    <6fd>   DW_AT_decl_column : 15
    <6fe>   DW_AT_type        : <0x5c>
    <702>   DW_AT_data_member_location: 776
 <2><704>: Abbrev Number: 5 (DW_TAG_member)
    <705>   DW_AT_name        : (indirect string, offset: 0x759f): trace_bprintk_fmt_start
    <709>   DW_AT_decl_file   : 20
    <70a>   DW_AT_decl_line   : 488
    <70c>   DW_AT_decl_column : 15
    <70d>   DW_AT_type        : <0xb2e>
    <711>   DW_AT_data_member_location: 784
 <2><713>: Abbrev Number: 5 (DW_TAG_member)
    <714>   DW_AT_name        : (indirect string, offset: 0x695e): trace_events
    <718>   DW_AT_decl_file   : 20
    <719>   DW_AT_decl_line   : 491
    <71b>   DW_AT_decl_column : 28
    <71c>   DW_AT_type        : <0x9da1>
    <720>   DW_AT_data_member_location: 792
 <2><722>: Abbrev Number: 5 (DW_TAG_member)
    <723>   DW_AT_name        : (indirect string, offset: 0xc07): num_trace_events
    <727>   DW_AT_decl_file   : 20
    <728>   DW_AT_decl_line   : 492
    <72a>   DW_AT_decl_column : 15
    <72b>   DW_AT_type        : <0x5c>
    <72f>   DW_AT_data_member_location: 800
 <2><731>: Abbrev Number: 5 (DW_TAG_member)
    <732>   DW_AT_name        : (indirect string, offset: 0x184a): trace_evals
    <736>   DW_AT_decl_file   : 20
    <737>   DW_AT_decl_line   : 493
    <739>   DW_AT_decl_column : 26
    <73a>   DW_AT_type        : <0x9db0>
    <73e>   DW_AT_data_member_location: 808
 <2><740>: Abbrev Number: 5 (DW_TAG_member)
    <741>   DW_AT_name        : (indirect string, offset: 0x87c): num_trace_evals
    <745>   DW_AT_decl_file   : 20
    <746>   DW_AT_decl_line   : 494
    <748>   DW_AT_decl_column : 15
    <749>   DW_AT_type        : <0x5c>
    <74d>   DW_AT_data_member_location: 816
 <2><74f>: Abbrev Number: 5 (DW_TAG_member)
    <750>   DW_AT_name        : (indirect string, offset: 0x14d6): num_ftrace_callsites
    <754>   DW_AT_decl_file   : 20
    <755>   DW_AT_decl_line   : 497
    <757>   DW_AT_decl_column : 15
    <758>   DW_AT_type        : <0x5c>
    <75c>   DW_AT_data_member_location: 820
 <2><75e>: Abbrev Number: 5 (DW_TAG_member)
    <75f>   DW_AT_name        : (indirect string, offset: 0x6132): ftrace_callsites
    <763>   DW_AT_decl_file   : 20
    <764>   DW_AT_decl_line   : 498
    <766>   DW_AT_decl_column : 17
    <767>   DW_AT_type        : <0xb33>
    <76b>   DW_AT_data_member_location: 824
 <2><76d>: Abbrev Number: 5 (DW_TAG_member)
    <76e>   DW_AT_name        : (indirect string, offset: 0x3361): kprobes_text_start
    <772>   DW_AT_decl_file   : 20
    <773>   DW_AT_decl_line   : 501
    <775>   DW_AT_decl_column : 8
    <776>   DW_AT_type        : <0x414>
    <77a>   DW_AT_data_member_location: 832
 <2><77c>: Abbrev Number: 5 (DW_TAG_member)
    <77d>   DW_AT_name        : (indirect string, offset: 0x781d): kprobes_text_size
    <781>   DW_AT_decl_file   : 20
    <782>   DW_AT_decl_line   : 502
    <784>   DW_AT_decl_column : 15
    <785>   DW_AT_type        : <0x5c>
    <789>   DW_AT_data_member_location: 840
 <2><78b>: Abbrev Number: 5 (DW_TAG_member)
    <78c>   DW_AT_name        : (indirect string, offset: 0x56e1): kprobe_blacklist
    <790>   DW_AT_decl_file   : 20
    <791>   DW_AT_decl_line   : 503
    <793>   DW_AT_decl_column : 17
    <794>   DW_AT_type        : <0xb33>
    <798>   DW_AT_data_member_location: 848
 <2><79a>: Abbrev Number: 5 (DW_TAG_member)
    <79b>   DW_AT_name        : (indirect string, offset: 0x9bd): num_kprobe_blacklist
    <79f>   DW_AT_decl_file   : 20
    <7a0>   DW_AT_decl_line   : 504
    <7a2>   DW_AT_decl_column : 15
    <7a3>   DW_AT_type        : <0x5c>
    <7a7>   DW_AT_data_member_location: 856
 <2><7a9>: Abbrev Number: 5 (DW_TAG_member)
    <7aa>   DW_AT_name        : (indirect string, offset: 0x527d): source_list
    <7ae>   DW_AT_decl_file   : 20
    <7af>   DW_AT_decl_line   : 531
    <7b1>   DW_AT_decl_column : 19
    <7b2>   DW_AT_type        : <0x34d>
    <7b6>   DW_AT_data_member_location: 864
 <2><7b8>: Abbrev Number: 5 (DW_TAG_member)
    <7b9>   DW_AT_name        : (indirect string, offset: 0x1948): target_list
    <7bd>   DW_AT_decl_file   : 20
    <7be>   DW_AT_decl_line   : 533
    <7c0>   DW_AT_decl_column : 19
    <7c1>   DW_AT_type        : <0x34d>
    <7c5>   DW_AT_data_member_location: 880
 <2><7c7>: Abbrev Number: 5 (DW_TAG_member)
    <7c8>   DW_AT_name        : (indirect string, offset: 0x129e): exit
    <7cc>   DW_AT_decl_file   : 20
    <7cd>   DW_AT_decl_line   : 536
    <7cf>   DW_AT_decl_column : 9
    <7d0>   DW_AT_type        : <0x836>
    <7d4>   DW_AT_data_member_location: 896
 <2><7d6>: Abbrev Number: 5 (DW_TAG_member)
    <7d7>   DW_AT_name        : (indirect string, offset: 0x6974): refcnt
    <7db>   DW_AT_decl_file   : 20
    <7dc>   DW_AT_decl_line   : 538
    <7de>   DW_AT_decl_column : 11
    <7df>   DW_AT_type        : <0x31e>
    <7e3>   DW_AT_data_member_location: 904
 <2><7e5>: Abbrev Number: 0
 <1><7e6>: Abbrev Number: 107 (DW_TAG_variable)
    <7e7>   DW_AT_name        : (indirect string, offset: 0x6ee6): __this_module
    <7eb>   DW_AT_decl_file   : 21
    <7ec>   DW_AT_decl_line   : 26
    <7ed>   DW_AT_decl_column : 22
    <7ee>   DW_AT_type        : <0x421>
    <7f2>   DW_AT_external    : 1
    <7f2>   DW_AT_declaration : 1
 <1><7f2>: Abbrev Number: 8 (DW_TAG_structure_type)
    <7f3>   DW_AT_name        : (indirect string, offset: 0x2258): kernel_symbol
    <7f7>   DW_AT_byte_size   : 12
    <7f8>   DW_AT_decl_file   : 21
    <7f9>   DW_AT_decl_line   : 50
    <7fa>   DW_AT_decl_column : 8
    <7fb>   DW_AT_sibling     : <0x827>
 <2><7ff>: Abbrev Number: 1 (DW_TAG_member)
    <800>   DW_AT_name        : (indirect string, offset: 0x2a3e): value_offset
    <804>   DW_AT_decl_file   : 21
    <805>   DW_AT_decl_line   : 51
    <806>   DW_AT_decl_column : 6
    <807>   DW_AT_type        : <0xb9>
    <80b>   DW_AT_data_member_location: 0
 <2><80c>: Abbrev Number: 1 (DW_TAG_member)
    <80d>   DW_AT_name        : (indirect string, offset: 0x6846): name_offset
    <811>   DW_AT_decl_file   : 21
    <812>   DW_AT_decl_line   : 52
    <813>   DW_AT_decl_column : 6
    <814>   DW_AT_type        : <0xb9>
    <818>   DW_AT_data_member_location: 4
 <2><819>: Abbrev Number: 1 (DW_TAG_member)
    <81a>   DW_AT_name        : (indirect string, offset: 0x2ea5): namespace_offset
    <81e>   DW_AT_decl_file   : 21
    <81f>   DW_AT_decl_line   : 53
    <820>   DW_AT_decl_column : 6
    <821>   DW_AT_type        : <0xb9>
    <825>   DW_AT_data_member_location: 8
 <2><826>: Abbrev Number: 0
 <1><827>: Abbrev Number: 14 (DW_TAG_const_type)
    <828>   DW_AT_type        : <0x7f2>
 <1><82c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <82d>   DW_AT_byte_size   : 8
    <82d>   DW_AT_type        : <0x831>
 <1><831>: Abbrev Number: 71 (DW_TAG_subroutine_type)
    <832>   DW_AT_prototyped  : 1
    <832>   DW_AT_type        : <0xb9>
 <1><836>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <837>   DW_AT_byte_size   : 8
    <837>   DW_AT_type        : <0x83b>
 <1><83b>: Abbrev Number: 126 (DW_TAG_subroutine_type)
    <83c>   DW_AT_prototyped  : 1
 <1><83c>: Abbrev Number: 22 (DW_TAG_structure_type)
    <83d>   DW_AT_name        : (indirect string, offset: 0x772e): file_system_type
    <841>   DW_AT_byte_size   : 72
    <842>   DW_AT_decl_file   : 22
    <843>   DW_AT_decl_line   : 2608
    <845>   DW_AT_decl_column : 8
    <846>   DW_AT_sibling     : <0x939>
 <2><84a>: Abbrev Number: 2 (DW_TAG_member)
    <84b>   DW_AT_name        : (indirect string, offset: 0x5b4): name
    <84f>   DW_AT_decl_file   : 22
    <850>   DW_AT_decl_line   : 2609
    <852>   DW_AT_decl_column : 14
    <853>   DW_AT_type        : <0x4b>
    <857>   DW_AT_data_member_location: 0
 <2><858>: Abbrev Number: 2 (DW_TAG_member)
    <859>   DW_AT_name        : (indirect string, offset: 0x668): fs_flags
    <85d>   DW_AT_decl_file   : 22
    <85e>   DW_AT_decl_line   : 2610
    <860>   DW_AT_decl_column : 6
    <861>   DW_AT_type        : <0xb9>
    <865>   DW_AT_data_member_location: 8
 <2><866>: Abbrev Number: 2 (DW_TAG_member)
    <867>   DW_AT_name        : (indirect string, offset: 0x12a): init_fs_context
    <86b>   DW_AT_decl_file   : 22
    <86c>   DW_AT_decl_line   : 2618
    <86e>   DW_AT_decl_column : 8
    <86f>   DW_AT_type        : <0x8df4>
    <873>   DW_AT_data_member_location: 16
 <2><874>: Abbrev Number: 2 (DW_TAG_member)
    <875>   DW_AT_name        : (indirect string, offset: 0x2875): parameters
    <879>   DW_AT_decl_file   : 22
    <87a>   DW_AT_decl_line   : 2619
    <87c>   DW_AT_decl_column : 34
    <87d>   DW_AT_type        : <0x8e03>
    <881>   DW_AT_data_member_location: 24
 <2><882>: Abbrev Number: 2 (DW_TAG_member)
    <883>   DW_AT_name        : (indirect string, offset: 0xec0): mount
    <887>   DW_AT_decl_file   : 22
    <888>   DW_AT_decl_line   : 2620
    <88a>   DW_AT_decl_column : 19
    <88b>   DW_AT_type        : <0x8e26>
    <88f>   DW_AT_data_member_location: 32
 <2><890>: Abbrev Number: 2 (DW_TAG_member)
    <891>   DW_AT_name        : (indirect string, offset: 0x62f8): kill_sb
    <895>   DW_AT_decl_file   : 22
    <896>   DW_AT_decl_line   : 2622
    <898>   DW_AT_decl_column : 9
    <899>   DW_AT_type        : <0x8ce6>
    <89d>   DW_AT_data_member_location: 40
 <2><89e>: Abbrev Number: 2 (DW_TAG_member)
    <89f>   DW_AT_name        : (indirect string, offset: 0x207f): owner
    <8a3>   DW_AT_decl_file   : 22
    <8a4>   DW_AT_decl_line   : 2623
    <8a6>   DW_AT_decl_column : 17
    <8a7>   DW_AT_type        : <0xb29>
    <8ab>   DW_AT_data_member_location: 48
 <2><8ac>: Abbrev Number: 2 (DW_TAG_member)
    <8ad>   DW_AT_name        : (indirect string, offset: 0x280d): next
    <8b1>   DW_AT_decl_file   : 22
    <8b2>   DW_AT_decl_line   : 2624
    <8b4>   DW_AT_decl_column : 28
    <8b5>   DW_AT_type        : <0x8408>
    <8b9>   DW_AT_data_member_location: 56
 <2><8ba>: Abbrev Number: 2 (DW_TAG_member)
    <8bb>   DW_AT_name        : (indirect string, offset: 0x45d7): fs_supers
    <8bf>   DW_AT_decl_file   : 22
    <8c0>   DW_AT_decl_line   : 2625
    <8c2>   DW_AT_decl_column : 20
    <8c3>   DW_AT_type        : <0x37a>
    <8c7>   DW_AT_data_member_location: 64
 <2><8c8>: Abbrev Number: 2 (DW_TAG_member)
    <8c9>   DW_AT_name        : (indirect string, offset: 0x326d): s_lock_key
    <8cd>   DW_AT_decl_file   : 22
    <8ce>   DW_AT_decl_line   : 2627
    <8d0>   DW_AT_decl_column : 24
    <8d1>   DW_AT_type        : <0xa64>
    <8d5>   DW_AT_data_member_location: 72
 <2><8d6>: Abbrev Number: 2 (DW_TAG_member)
    <8d7>   DW_AT_name        : (indirect string, offset: 0x40ab): s_umount_key
    <8db>   DW_AT_decl_file   : 22
    <8dc>   DW_AT_decl_line   : 2628
    <8de>   DW_AT_decl_column : 24
    <8df>   DW_AT_type        : <0xa64>
    <8e3>   DW_AT_data_member_location: 72
 <2><8e4>: Abbrev Number: 2 (DW_TAG_member)
    <8e5>   DW_AT_name        : (indirect string, offset: 0x29ba): s_vfs_rename_key
    <8e9>   DW_AT_decl_file   : 22
    <8ea>   DW_AT_decl_line   : 2629
    <8ec>   DW_AT_decl_column : 24
    <8ed>   DW_AT_type        : <0xa64>
    <8f1>   DW_AT_data_member_location: 72
 <2><8f2>: Abbrev Number: 2 (DW_TAG_member)
    <8f3>   DW_AT_name        : (indirect string, offset: 0x1da5): s_writers_key
    <8f7>   DW_AT_decl_file   : 22
    <8f8>   DW_AT_decl_line   : 2630
    <8fa>   DW_AT_decl_column : 24
    <8fb>   DW_AT_type        : <0x8e2b>
    <8ff>   DW_AT_data_member_location: 72
 <2><900>: Abbrev Number: 2 (DW_TAG_member)
    <901>   DW_AT_name        : (indirect string, offset: 0x42e6): i_lock_key
    <905>   DW_AT_decl_file   : 22
    <906>   DW_AT_decl_line   : 2632
    <908>   DW_AT_decl_column : 24
    <909>   DW_AT_type        : <0xa64>
    <90d>   DW_AT_data_member_location: 72
 <2><90e>: Abbrev Number: 2 (DW_TAG_member)
    <90f>   DW_AT_name        : (indirect string, offset: 0x4cea): i_mutex_key
    <913>   DW_AT_decl_file   : 22
    <914>   DW_AT_decl_line   : 2633
    <916>   DW_AT_decl_column : 24
    <917>   DW_AT_type        : <0xa64>
    <91b>   DW_AT_data_member_location: 72
 <2><91c>: Abbrev Number: 2 (DW_TAG_member)
    <91d>   DW_AT_name        : (indirect string, offset: 0x6e2a): invalidate_lock_key
    <921>   DW_AT_decl_file   : 22
    <922>   DW_AT_decl_line   : 2634
    <924>   DW_AT_decl_column : 24
    <925>   DW_AT_type        : <0xa64>
    <929>   DW_AT_data_member_location: 72
 <2><92a>: Abbrev Number: 2 (DW_TAG_member)
    <92b>   DW_AT_name        : (indirect string, offset: 0x2abc): i_mutex_dir_key
    <92f>   DW_AT_decl_file   : 22
    <930>   DW_AT_decl_line   : 2635
    <932>   DW_AT_decl_column : 24
    <933>   DW_AT_type        : <0xa64>
    <937>   DW_AT_data_member_location: 72
 <2><938>: Abbrev Number: 0
 <1><939>: Abbrev Number: 11 (DW_TAG_typedef)
    <93a>   DW_AT_name        : (indirect string, offset: 0x548f): atomic_long_t
    <93e>   DW_AT_decl_file   : 23
    <93f>   DW_AT_decl_line   : 13
    <940>   DW_AT_decl_column : 20
    <941>   DW_AT_type        : <0x341>
 <1><945>: Abbrev Number: 8 (DW_TAG_structure_type)
    <946>   DW_AT_name        : (indirect string, offset: 0x1547): static_key
    <94a>   DW_AT_byte_size   : 4
    <94b>   DW_AT_decl_file   : 24
    <94c>   DW_AT_decl_line   : 85
    <94d>   DW_AT_decl_column : 8
    <94e>   DW_AT_sibling     : <0x960>
 <2><952>: Abbrev Number: 1 (DW_TAG_member)
    <953>   DW_AT_name        : (indirect string, offset: 0xca): enabled
    <957>   DW_AT_decl_file   : 24
    <958>   DW_AT_decl_line   : 86
    <959>   DW_AT_decl_column : 11
    <95a>   DW_AT_type        : <0x31e>
    <95e>   DW_AT_data_member_location: 0
 <2><95f>: Abbrev Number: 0
 <1><960>: Abbrev Number: 20 (DW_TAG_structure_type)
    <961>   DW_AT_byte_size   : 2
    <962>   DW_AT_decl_file   : 25
    <963>   DW_AT_decl_line   : 24
    <964>   DW_AT_decl_column : 3
    <965>   DW_AT_sibling     : <0x984>
 <2><969>: Abbrev Number: 1 (DW_TAG_member)
    <96a>   DW_AT_name        : (indirect string, offset: 0x5555): locked
    <96e>   DW_AT_decl_file   : 25
    <96f>   DW_AT_decl_line   : 25
    <970>   DW_AT_decl_column : 7
    <971>   DW_AT_type        : <0x100>
    <975>   DW_AT_data_member_location: 0
 <2><976>: Abbrev Number: 1 (DW_TAG_member)
    <977>   DW_AT_name        : (indirect string, offset: 0xf0d): pending
    <97b>   DW_AT_decl_file   : 25
    <97c>   DW_AT_decl_line   : 26
    <97d>   DW_AT_decl_column : 7
    <97e>   DW_AT_type        : <0x100>
    <982>   DW_AT_data_member_location: 1
 <2><983>: Abbrev Number: 0
 <1><984>: Abbrev Number: 20 (DW_TAG_structure_type)
    <985>   DW_AT_byte_size   : 4
    <986>   DW_AT_decl_file   : 25
    <987>   DW_AT_decl_line   : 28
    <988>   DW_AT_decl_column : 3
    <989>   DW_AT_sibling     : <0x9a8>
 <2><98d>: Abbrev Number: 1 (DW_TAG_member)
    <98e>   DW_AT_name        : (indirect string, offset: 0x10e4): locked_pending
    <992>   DW_AT_decl_file   : 25
    <993>   DW_AT_decl_line   : 29
    <994>   DW_AT_decl_column : 8
    <995>   DW_AT_type        : <0x109>
    <999>   DW_AT_data_member_location: 0
 <2><99a>: Abbrev Number: 1 (DW_TAG_member)
    <99b>   DW_AT_name        : (indirect string, offset: 0x26a1): tail
    <99f>   DW_AT_decl_file   : 25
    <9a0>   DW_AT_decl_line   : 30
    <9a1>   DW_AT_decl_column : 8
    <9a2>   DW_AT_type        : <0x109>
    <9a6>   DW_AT_data_member_location: 2
 <2><9a7>: Abbrev Number: 0
 <1><9a8>: Abbrev Number: 26 (DW_TAG_union_type)
    <9a9>   DW_AT_byte_size   : 4
    <9aa>   DW_AT_decl_file   : 25
    <9ab>   DW_AT_decl_line   : 15
    <9ac>   DW_AT_decl_column : 2
    <9ad>   DW_AT_sibling     : <0x9c8>
 <2><9b1>: Abbrev Number: 47 (DW_TAG_member)
    <9b2>   DW_AT_name        : val
    <9b6>   DW_AT_decl_file   : 25
    <9b7>   DW_AT_decl_line   : 16
    <9b8>   DW_AT_decl_column : 12
    <9b9>   DW_AT_type        : <0x31e>
 <2><9bd>: Abbrev Number: 28 (DW_TAG_member)
    <9be>   DW_AT_type        : <0x960>
 <2><9c2>: Abbrev Number: 28 (DW_TAG_member)
    <9c3>   DW_AT_type        : <0x984>
 <2><9c7>: Abbrev Number: 0
 <1><9c8>: Abbrev Number: 8 (DW_TAG_structure_type)
    <9c9>   DW_AT_name        : (indirect string, offset: 0x6ac0): qspinlock
    <9cd>   DW_AT_byte_size   : 4
    <9ce>   DW_AT_decl_file   : 25
    <9cf>   DW_AT_decl_line   : 14
    <9d0>   DW_AT_decl_column : 16
    <9d1>   DW_AT_sibling     : <0x9dc>
 <2><9d5>: Abbrev Number: 25 (DW_TAG_member)
    <9d6>   DW_AT_type        : <0x9a8>
    <9da>   DW_AT_data_member_location: 0
 <2><9db>: Abbrev Number: 0
 <1><9dc>: Abbrev Number: 11 (DW_TAG_typedef)
    <9dd>   DW_AT_name        : (indirect string, offset: 0x2dc0): arch_spinlock_t
    <9e1>   DW_AT_decl_file   : 25
    <9e2>   DW_AT_decl_line   : 44
    <9e3>   DW_AT_decl_column : 3
    <9e4>   DW_AT_type        : <0x9c8>
 <1><9e8>: Abbrev Number: 20 (DW_TAG_structure_type)
    <9e9>   DW_AT_byte_size   : 4
    <9ea>   DW_AT_decl_file   : 26
    <9eb>   DW_AT_decl_line   : 16
    <9ec>   DW_AT_decl_column : 3
    <9ed>   DW_AT_sibling     : <0xa0c>
 <2><9f1>: Abbrev Number: 1 (DW_TAG_member)
    <9f2>   DW_AT_name        : (indirect string, offset: 0x1527): wlocked
    <9f6>   DW_AT_decl_file   : 26
    <9f7>   DW_AT_decl_line   : 18
    <9f8>   DW_AT_decl_column : 7
    <9f9>   DW_AT_type        : <0x100>
    <9fd>   DW_AT_data_member_location: 0
 <2><9fe>: Abbrev Number: 1 (DW_TAG_member)
    <9ff>   DW_AT_name        : (indirect string, offset: 0x5cc3): __lstate
    <a03>   DW_AT_decl_file   : 26
    <a04>   DW_AT_decl_line   : 19
    <a05>   DW_AT_decl_column : 7
    <a06>   DW_AT_type        : <0xa0c>
    <a0a>   DW_AT_data_member_location: 1
 <2><a0b>: Abbrev Number: 0
 <1><a0c>: Abbrev Number: 17 (DW_TAG_array_type)
    <a0d>   DW_AT_type        : <0x100>
    <a11>   DW_AT_sibling     : <0xa1c>
 <2><a15>: Abbrev Number: 18 (DW_TAG_subrange_type)
    <a16>   DW_AT_type        : <0x2a>
    <a1a>   DW_AT_upper_bound : 2
 <2><a1b>: Abbrev Number: 0
 <1><a1c>: Abbrev Number: 26 (DW_TAG_union_type)
    <a1d>   DW_AT_byte_size   : 4
    <a1e>   DW_AT_decl_file   : 26
    <a1f>   DW_AT_decl_line   : 14
    <a20>   DW_AT_decl_column : 2
    <a21>   DW_AT_sibling     : <0xa37>
 <2><a25>: Abbrev Number: 16 (DW_TAG_member)
    <a26>   DW_AT_name        : (indirect string, offset: 0x2739): cnts
    <a2a>   DW_AT_decl_file   : 26
    <a2b>   DW_AT_decl_line   : 15
    <a2c>   DW_AT_decl_column : 12
    <a2d>   DW_AT_type        : <0x31e>
 <2><a31>: Abbrev Number: 28 (DW_TAG_member)
    <a32>   DW_AT_type        : <0x9e8>
 <2><a36>: Abbrev Number: 0
 <1><a37>: Abbrev Number: 8 (DW_TAG_structure_type)
    <a38>   DW_AT_name        : (indirect string, offset: 0x32ab): qrwlock
    <a3c>   DW_AT_byte_size   : 8
    <a3d>   DW_AT_decl_file   : 26
    <a3e>   DW_AT_decl_line   : 13
    <a3f>   DW_AT_decl_column : 16
    <a40>   DW_AT_sibling     : <0xa58>
 <2><a44>: Abbrev Number: 25 (DW_TAG_member)
    <a45>   DW_AT_type        : <0xa1c>
    <a49>   DW_AT_data_member_location: 0
 <2><a4a>: Abbrev Number: 1 (DW_TAG_member)
    <a4b>   DW_AT_name        : (indirect string, offset: 0xbb5): wait_lock
    <a4f>   DW_AT_decl_file   : 26
    <a50>   DW_AT_decl_line   : 26
    <a51>   DW_AT_decl_column : 19
    <a52>   DW_AT_type        : <0x9dc>
    <a56>   DW_AT_data_member_location: 4
 <2><a57>: Abbrev Number: 0
 <1><a58>: Abbrev Number: 11 (DW_TAG_typedef)
    <a59>   DW_AT_name        : (indirect string, offset: 0x4b1f): arch_rwlock_t
    <a5d>   DW_AT_decl_file   : 26
    <a5e>   DW_AT_decl_line   : 27
    <a5f>   DW_AT_decl_column : 3
    <a60>   DW_AT_type        : <0xa37>
 <1><a64>: Abbrev Number: 72 (DW_TAG_structure_type)
    <a65>   DW_AT_name        : (indirect string, offset: 0x330f): lock_class_key
    <a69>   DW_AT_byte_size   : 0
    <a69>   DW_AT_decl_file   : 27
    <a6a>   DW_AT_decl_line   : 197
    <a6b>   DW_AT_decl_column : 8
 <1><a6b>: Abbrev Number: 72 (DW_TAG_structure_type)
    <a6c>   DW_AT_name        : (indirect string, offset: 0x396a): lockdep_map
    <a70>   DW_AT_byte_size   : 0
    <a70>   DW_AT_decl_file   : 27
    <a71>   DW_AT_decl_line   : 202
    <a72>   DW_AT_decl_column : 8
 <1><a72>: Abbrev Number: 8 (DW_TAG_structure_type)
    <a73>   DW_AT_name        : (indirect string, offset: 0x74fa): raw_spinlock
    <a77>   DW_AT_byte_size   : 24
    <a78>   DW_AT_decl_file   : 28
    <a79>   DW_AT_decl_line   : 14
    <a7a>   DW_AT_decl_column : 16
    <a7b>   DW_AT_sibling     : <0xab4>
 <2><a7f>: Abbrev Number: 1 (DW_TAG_member)
    <a80>   DW_AT_name        : (indirect string, offset: 0x727a): raw_lock
    <a84>   DW_AT_decl_file   : 28
    <a85>   DW_AT_decl_line   : 15
    <a86>   DW_AT_decl_column : 18
    <a87>   DW_AT_type        : <0x9dc>
    <a8b>   DW_AT_data_member_location: 0
 <2><a8c>: Abbrev Number: 1 (DW_TAG_member)
    <a8d>   DW_AT_name        : (indirect string, offset: 0x2940): magic
    <a91>   DW_AT_decl_file   : 28
    <a92>   DW_AT_decl_line   : 17
    <a93>   DW_AT_decl_column : 15
    <a94>   DW_AT_type        : <0x5c>
    <a98>   DW_AT_data_member_location: 4
 <2><a99>: Abbrev Number: 1 (DW_TAG_member)
    <a9a>   DW_AT_name        : (indirect string, offset: 0x6bf9): owner_cpu
    <a9e>   DW_AT_decl_file   : 28
    <a9f>   DW_AT_decl_line   : 17
    <aa0>   DW_AT_decl_column : 22
    <aa1>   DW_AT_type        : <0x5c>
    <aa5>   DW_AT_data_member_location: 8
 <2><aa6>: Abbrev Number: 1 (DW_TAG_member)
    <aa7>   DW_AT_name        : (indirect string, offset: 0x207f): owner
    <aab>   DW_AT_decl_file   : 28
    <aac>   DW_AT_decl_line   : 18
    <aad>   DW_AT_decl_column : 8
    <aae>   DW_AT_type        : <0x414>
    <ab2>   DW_AT_data_member_location: 16
 <2><ab3>: Abbrev Number: 0
 <1><ab4>: Abbrev Number: 11 (DW_TAG_typedef)
    <ab5>   DW_AT_name        : (indirect string, offset: 0x72c1): raw_spinlock_t
    <ab9>   DW_AT_decl_file   : 28
    <aba>   DW_AT_decl_line   : 23
    <abb>   DW_AT_decl_column : 3
    <abc>   DW_AT_type        : <0xa72>
 <1><ac0>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ac1>   DW_AT_name        : (indirect string, offset: 0x6a4): ratelimit_state
    <ac5>   DW_AT_byte_size   : 56
    <ac6>   DW_AT_decl_file   : 29
    <ac7>   DW_AT_decl_line   : 15
    <ac8>   DW_AT_decl_column : 8
    <ac9>   DW_AT_sibling     : <0xb29>
 <2><acd>: Abbrev Number: 1 (DW_TAG_member)
    <ace>   DW_AT_name        : (indirect string, offset: 0x193e): lock
    <ad2>   DW_AT_decl_file   : 29
    <ad3>   DW_AT_decl_line   : 16
    <ad4>   DW_AT_decl_column : 17
    <ad5>   DW_AT_type        : <0xab4>
    <ad9>   DW_AT_data_member_location: 0
 <2><ada>: Abbrev Number: 1 (DW_TAG_member)
    <adb>   DW_AT_name        : (indirect string, offset: 0x3881): interval
    <adf>   DW_AT_decl_file   : 29
    <ae0>   DW_AT_decl_line   : 18
    <ae1>   DW_AT_decl_column : 7
    <ae2>   DW_AT_type        : <0xb9>
    <ae6>   DW_AT_data_member_location: 24
 <2><ae7>: Abbrev Number: 1 (DW_TAG_member)
    <ae8>   DW_AT_name        : (indirect string, offset: 0x103d): burst
    <aec>   DW_AT_decl_file   : 29
    <aed>   DW_AT_decl_line   : 19
    <aee>   DW_AT_decl_column : 7
    <aef>   DW_AT_type        : <0xb9>
    <af3>   DW_AT_data_member_location: 28
 <2><af4>: Abbrev Number: 1 (DW_TAG_member)
    <af5>   DW_AT_name        : (indirect string, offset: 0x4416): printed
    <af9>   DW_AT_decl_file   : 29
    <afa>   DW_AT_decl_line   : 20
    <afb>   DW_AT_decl_column : 7
    <afc>   DW_AT_type        : <0xb9>
    <b00>   DW_AT_data_member_location: 32
 <2><b01>: Abbrev Number: 1 (DW_TAG_member)
    <b02>   DW_AT_name        : (indirect string, offset: 0x740e): missed
    <b06>   DW_AT_decl_file   : 29
    <b07>   DW_AT_decl_line   : 21
    <b08>   DW_AT_decl_column : 7
    <b09>   DW_AT_type        : <0xb9>
    <b0d>   DW_AT_data_member_location: 36
 <2><b0e>: Abbrev Number: 1 (DW_TAG_member)
    <b0f>   DW_AT_name        : (indirect string, offset: 0x405b): begin
    <b13>   DW_AT_decl_file   : 29
    <b14>   DW_AT_decl_line   : 22
    <b15>   DW_AT_decl_column : 16
    <b16>   DW_AT_type        : <0x2a>
    <b1a>   DW_AT_data_member_location: 40
 <2><b1b>: Abbrev Number: 1 (DW_TAG_member)
    <b1c>   DW_AT_name        : (indirect string, offset: 0x6a16): flags
    <b20>   DW_AT_decl_file   : 29
    <b21>   DW_AT_decl_line   : 23
    <b22>   DW_AT_decl_column : 16
    <b23>   DW_AT_type        : <0x2a>
    <b27>   DW_AT_data_member_location: 48
 <2><b28>: Abbrev Number: 0
 <1><b29>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b2a>   DW_AT_byte_size   : 8
    <b2a>   DW_AT_type        : <0x421>
 <1><b2e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b2f>   DW_AT_byte_size   : 8
    <b2f>   DW_AT_type        : <0x4b>
 <1><b33>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b34>   DW_AT_byte_size   : 8
    <b34>   DW_AT_type        : <0x2a>
 <1><b38>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b39>   DW_AT_byte_size   : 8
    <b39>   DW_AT_type        : <0x5c>
 <1><b3d>: Abbrev Number: 17 (DW_TAG_array_type)
    <b3e>   DW_AT_type        : <0x50>
    <b42>   DW_AT_sibling     : <0xb4d>
 <2><b46>: Abbrev Number: 18 (DW_TAG_subrange_type)
    <b47>   DW_AT_type        : <0x2a>
    <b4b>   DW_AT_upper_bound : 7
 <2><b4c>: Abbrev Number: 0
 <1><b4d>: Abbrev Number: 8 (DW_TAG_structure_type)
    <b4e>   DW_AT_name        : (indirect string, offset: 0xa62): kernel_param_ops
    <b52>   DW_AT_byte_size   : 32
    <b53>   DW_AT_decl_file   : 30
    <b54>   DW_AT_decl_line   : 47
    <b55>   DW_AT_decl_column : 8
    <b56>   DW_AT_sibling     : <0xb8f>
 <2><b5a>: Abbrev Number: 1 (DW_TAG_member)
    <b5b>   DW_AT_name        : (indirect string, offset: 0x6a16): flags
    <b5f>   DW_AT_decl_file   : 30
    <b60>   DW_AT_decl_line   : 49
    <b61>   DW_AT_decl_column : 15
    <b62>   DW_AT_type        : <0x5c>
    <b66>   DW_AT_data_member_location: 0
 <2><b67>: Abbrev Number: 9 (DW_TAG_member)
    <b68>   DW_AT_name        : set
    <b6c>   DW_AT_decl_file   : 30
    <b6d>   DW_AT_decl_line   : 51
    <b6e>   DW_AT_decl_column : 8
    <b6f>   DW_AT_type        : <0x985b>
    <b73>   DW_AT_data_member_location: 8
 <2><b74>: Abbrev Number: 9 (DW_TAG_member)
    <b75>   DW_AT_name        : get
    <b79>   DW_AT_decl_file   : 30
    <b7a>   DW_AT_decl_line   : 53
    <b7b>   DW_AT_decl_column : 8
    <b7c>   DW_AT_type        : <0x9874>
    <b80>   DW_AT_data_member_location: 16
 <2><b81>: Abbrev Number: 1 (DW_TAG_member)
    <b82>   DW_AT_name        : (indirect string, offset: 0x4324): free
    <b86>   DW_AT_decl_file   : 30
    <b87>   DW_AT_decl_line   : 55
    <b88>   DW_AT_decl_column : 9
    <b89>   DW_AT_type        : <0xf22>
    <b8d>   DW_AT_data_member_location: 24
 <2><b8e>: Abbrev Number: 0
 <1><b8f>: Abbrev Number: 14 (DW_TAG_const_type)
    <b90>   DW_AT_type        : <0xb4d>
 <1><b94>: Abbrev Number: 86 (DW_TAG_structure_type)
    <b95>   DW_AT_name        : (indirect string, offset: 0x325d): file_operations
    <b99>   DW_AT_byte_size   : 280
    <b9b>   DW_AT_decl_file   : 22
    <b9c>   DW_AT_decl_line   : 2168
    <b9e>   DW_AT_decl_column : 8
    <b9e>   DW_AT_sibling     : <0xd90>
 <2><ba2>: Abbrev Number: 2 (DW_TAG_member)
    <ba3>   DW_AT_name        : (indirect string, offset: 0x207f): owner
    <ba7>   DW_AT_decl_file   : 22
    <ba8>   DW_AT_decl_line   : 2169
    <baa>   DW_AT_decl_column : 17
    <bab>   DW_AT_type        : <0xb29>
    <baf>   DW_AT_data_member_location: 0
 <2><bb0>: Abbrev Number: 2 (DW_TAG_member)
    <bb1>   DW_AT_name        : (indirect string, offset: 0x32dd): llseek
    <bb5>   DW_AT_decl_file   : 22
    <bb6>   DW_AT_decl_line   : 2170
    <bb8>   DW_AT_decl_column : 11
    <bb9>   DW_AT_type        : <0x8662>
    <bbd>   DW_AT_data_member_location: 8
 <2><bbe>: Abbrev Number: 2 (DW_TAG_member)
    <bbf>   DW_AT_name        : (indirect string, offset: 0x125): read
    <bc3>   DW_AT_decl_file   : 22
    <bc4>   DW_AT_decl_line   : 2171
    <bc6>   DW_AT_decl_column : 12
    <bc7>   DW_AT_type        : <0x8685>
    <bcb>   DW_AT_data_member_location: 16
 <2><bcc>: Abbrev Number: 2 (DW_TAG_member)
    <bcd>   DW_AT_name        : (indirect string, offset: 0x21bf): write
    <bd1>   DW_AT_decl_file   : 22
    <bd2>   DW_AT_decl_line   : 2172
    <bd4>   DW_AT_decl_column : 12
    <bd5>   DW_AT_type        : <0x86a8>
    <bd9>   DW_AT_data_member_location: 24
 <2><bda>: Abbrev Number: 2 (DW_TAG_member)
    <bdb>   DW_AT_name        : (indirect string, offset: 0x3baf): read_iter
    <bdf>   DW_AT_decl_file   : 22
    <be0>   DW_AT_decl_line   : 2173
    <be2>   DW_AT_decl_column : 12
    <be3>   DW_AT_type        : <0x7abf>
    <be7>   DW_AT_data_member_location: 32
 <2><be8>: Abbrev Number: 2 (DW_TAG_member)
    <be9>   DW_AT_name        : (indirect string, offset: 0x753b): write_iter
    <bed>   DW_AT_decl_file   : 22
    <bee>   DW_AT_decl_line   : 2174
    <bf0>   DW_AT_decl_column : 12
    <bf1>   DW_AT_type        : <0x7abf>
    <bf5>   DW_AT_data_member_location: 40
 <2><bf6>: Abbrev Number: 2 (DW_TAG_member)
    <bf7>   DW_AT_name        : (indirect string, offset: 0x28cb): iopoll
    <bfb>   DW_AT_decl_file   : 22
    <bfc>   DW_AT_decl_line   : 2175
    <bfe>   DW_AT_decl_column : 8
    <bff>   DW_AT_type        : <0x86d0>
    <c03>   DW_AT_data_member_location: 48
 <2><c04>: Abbrev Number: 2 (DW_TAG_member)
    <c05>   DW_AT_name        : (indirect string, offset: 0x5c67): iterate
    <c09>   DW_AT_decl_file   : 22
    <c0a>   DW_AT_decl_line   : 2177
    <c0c>   DW_AT_decl_column : 8
    <c0d>   DW_AT_type        : <0x86e9>
    <c11>   DW_AT_data_member_location: 56
 <2><c12>: Abbrev Number: 2 (DW_TAG_member)
    <c13>   DW_AT_name        : (indirect string, offset: 0x3848): iterate_shared
    <c17>   DW_AT_decl_file   : 22
    <c18>   DW_AT_decl_line   : 2178
    <c1a>   DW_AT_decl_column : 8
    <c1b>   DW_AT_type        : <0x86e9>
    <c1f>   DW_AT_data_member_location: 64
 <2><c20>: Abbrev Number: 2 (DW_TAG_member)
    <c21>   DW_AT_name        : (indirect string, offset: 0x121b): poll
    <c25>   DW_AT_decl_file   : 22
    <c26>   DW_AT_decl_line   : 2179
    <c28>   DW_AT_decl_column : 13
    <c29>   DW_AT_type        : <0x872f>
    <c2d>   DW_AT_data_member_location: 72
 <2><c2e>: Abbrev Number: 2 (DW_TAG_member)
    <c2f>   DW_AT_name        : (indirect string, offset: 0x5f19): unlocked_ioctl
    <c33>   DW_AT_decl_file   : 22
    <c34>   DW_AT_decl_line   : 2180
    <c36>   DW_AT_decl_column : 9
    <c37>   DW_AT_type        : <0x874d>
    <c3b>   DW_AT_data_member_location: 80
 <2><c3c>: Abbrev Number: 2 (DW_TAG_member)
    <c3d>   DW_AT_name        : (indirect string, offset: 0x501e): compat_ioctl
    <c41>   DW_AT_decl_file   : 22
    <c42>   DW_AT_decl_line   : 2181
    <c44>   DW_AT_decl_column : 9
    <c45>   DW_AT_type        : <0x874d>
    <c49>   DW_AT_data_member_location: 88
 <2><c4a>: Abbrev Number: 2 (DW_TAG_member)
    <c4b>   DW_AT_name        : (indirect string, offset: 0x637b): mmap
    <c4f>   DW_AT_decl_file   : 22
    <c50>   DW_AT_decl_line   : 2182
    <c52>   DW_AT_decl_column : 8
    <c53>   DW_AT_type        : <0x8766>
    <c57>   DW_AT_data_member_location: 96
 <2><c58>: Abbrev Number: 2 (DW_TAG_member)
    <c59>   DW_AT_name        : (indirect string, offset: 0x54f6): mmap_supported_flags
    <c5d>   DW_AT_decl_file   : 22
    <c5e>   DW_AT_decl_line   : 2183
    <c60>   DW_AT_decl_column : 16
    <c61>   DW_AT_type        : <0x2a>
    <c65>   DW_AT_data_member_location: 104
 <2><c66>: Abbrev Number: 2 (DW_TAG_member)
    <c67>   DW_AT_name        : (indirect string, offset: 0x6fce): open
    <c6b>   DW_AT_decl_file   : 22
    <c6c>   DW_AT_decl_line   : 2184
    <c6e>   DW_AT_decl_column : 8
    <c6f>   DW_AT_type        : <0x877f>
    <c73>   DW_AT_data_member_location: 112
 <2><c74>: Abbrev Number: 2 (DW_TAG_member)
    <c75>   DW_AT_name        : (indirect string, offset: 0x7043): flush
    <c79>   DW_AT_decl_file   : 22
    <c7a>   DW_AT_decl_line   : 2185
    <c7c>   DW_AT_decl_column : 8
    <c7d>   DW_AT_type        : <0x8798>
    <c81>   DW_AT_data_member_location: 120
 <2><c82>: Abbrev Number: 2 (DW_TAG_member)
    <c83>   DW_AT_name        : (indirect string, offset: 0x2ad): release
    <c87>   DW_AT_decl_file   : 22
    <c88>   DW_AT_decl_line   : 2186
    <c8a>   DW_AT_decl_column : 8
    <c8b>   DW_AT_type        : <0x877f>
    <c8f>   DW_AT_data_member_location: 128
 <2><c90>: Abbrev Number: 2 (DW_TAG_member)
    <c91>   DW_AT_name        : (indirect string, offset: 0xd70): fsync
    <c95>   DW_AT_decl_file   : 22
    <c96>   DW_AT_decl_line   : 2187
    <c98>   DW_AT_decl_column : 8
    <c99>   DW_AT_type        : <0x87bb>
    <c9d>   DW_AT_data_member_location: 136
 <2><c9e>: Abbrev Number: 2 (DW_TAG_member)
    <c9f>   DW_AT_name        : (indirect string, offset: 0x6dc5): fasync
    <ca3>   DW_AT_decl_file   : 22
    <ca4>   DW_AT_decl_line   : 2188
    <ca6>   DW_AT_decl_column : 8
    <ca7>   DW_AT_type        : <0x87d9>
    <cab>   DW_AT_data_member_location: 144
 <2><cac>: Abbrev Number: 2 (DW_TAG_member)
    <cad>   DW_AT_name        : (indirect string, offset: 0x193e): lock
    <cb1>   DW_AT_decl_file   : 22
    <cb2>   DW_AT_decl_line   : 2189
    <cb4>   DW_AT_decl_column : 8
    <cb5>   DW_AT_type        : <0x87f7>
    <cb9>   DW_AT_data_member_location: 152
 <2><cba>: Abbrev Number: 2 (DW_TAG_member)
    <cbb>   DW_AT_name        : (indirect string, offset: 0x8cb): sendpage
    <cbf>   DW_AT_decl_file   : 22
    <cc0>   DW_AT_decl_line   : 2190
    <cc2>   DW_AT_decl_column : 12
    <cc3>   DW_AT_type        : <0x8824>
    <cc7>   DW_AT_data_member_location: 160
 <2><cc8>: Abbrev Number: 2 (DW_TAG_member)
    <cc9>   DW_AT_name        : (indirect string, offset: 0x46f6): get_unmapped_area
    <ccd>   DW_AT_decl_file   : 22
    <cce>   DW_AT_decl_line   : 2191
    <cd0>   DW_AT_decl_column : 18
    <cd1>   DW_AT_type        : <0x5200>
    <cd5>   DW_AT_data_member_location: 168
 <2><cd6>: Abbrev Number: 2 (DW_TAG_member)
    <cd7>   DW_AT_name        : (indirect string, offset: 0xf44): check_flags
    <cdb>   DW_AT_decl_file   : 22
    <cdc>   DW_AT_decl_line   : 2192
    <cde>   DW_AT_decl_column : 8
    <cdf>   DW_AT_type        : <0x8829>
    <ce3>   DW_AT_data_member_location: 176
 <2><ce4>: Abbrev Number: 2 (DW_TAG_member)
    <ce5>   DW_AT_name        : (indirect string, offset: 0x3bc1): flock
    <ce9>   DW_AT_decl_file   : 22
    <cea>   DW_AT_decl_line   : 2193
    <cec>   DW_AT_decl_column : 8
    <ced>   DW_AT_type        : <0x87f7>
    <cf1>   DW_AT_data_member_location: 184
 <2><cf2>: Abbrev Number: 2 (DW_TAG_member)
    <cf3>   DW_AT_name        : (indirect string, offset: 0x840): splice_write
    <cf7>   DW_AT_decl_file   : 22
    <cf8>   DW_AT_decl_line   : 2194
    <cfa>   DW_AT_decl_column : 12
    <cfb>   DW_AT_type        : <0x8851>
    <cff>   DW_AT_data_member_location: 192
 <2><d00>: Abbrev Number: 2 (DW_TAG_member)
    <d01>   DW_AT_name        : (indirect string, offset: 0x60c4): splice_read
    <d05>   DW_AT_decl_file   : 22
    <d06>   DW_AT_decl_line   : 2195
    <d08>   DW_AT_decl_column : 12
    <d09>   DW_AT_type        : <0x8879>
    <d0d>   DW_AT_data_member_location: 200
 <2><d0e>: Abbrev Number: 2 (DW_TAG_member)
    <d0f>   DW_AT_name        : (indirect string, offset: 0x5a58): splice_eof
    <d13>   DW_AT_decl_file   : 22
    <d14>   DW_AT_decl_line   : 2196
    <d16>   DW_AT_decl_column : 9
    <d17>   DW_AT_type        : <0x7b89>
    <d1b>   DW_AT_data_member_location: 208
 <2><d1c>: Abbrev Number: 2 (DW_TAG_member)
    <d1d>   DW_AT_name        : (indirect string, offset: 0x2b67): setlease
    <d21>   DW_AT_decl_file   : 22
    <d22>   DW_AT_decl_line   : 2197
    <d24>   DW_AT_decl_column : 8
    <d25>   DW_AT_type        : <0x88a1>
    <d29>   DW_AT_data_member_location: 216
 <2><d2a>: Abbrev Number: 2 (DW_TAG_member)
    <d2b>   DW_AT_name        : (indirect string, offset: 0x6adb): fallocate
    <d2f>   DW_AT_decl_file   : 22
    <d30>   DW_AT_decl_line   : 2198
    <d32>   DW_AT_decl_column : 9
    <d33>   DW_AT_type        : <0x88c4>
    <d37>   DW_AT_data_member_location: 224
 <2><d38>: Abbrev Number: 2 (DW_TAG_member)
    <d39>   DW_AT_name        : (indirect string, offset: 0x3829): show_fdinfo
    <d3d>   DW_AT_decl_file   : 22
    <d3e>   DW_AT_decl_line   : 2200
    <d40>   DW_AT_decl_column : 9
    <d41>   DW_AT_type        : <0x88e3>
    <d45>   DW_AT_data_member_location: 232
 <2><d46>: Abbrev Number: 2 (DW_TAG_member)
    <d47>   DW_AT_name        : (indirect string, offset: 0x1d2c): copy_file_range
    <d4b>   DW_AT_decl_file   : 22
    <d4c>   DW_AT_decl_line   : 2204
    <d4e>   DW_AT_decl_column : 12
    <d4f>   DW_AT_type        : <0x8910>
    <d53>   DW_AT_data_member_location: 240
 <2><d54>: Abbrev Number: 2 (DW_TAG_member)
    <d55>   DW_AT_name        : (indirect string, offset: 0x2198): remap_file_range
    <d59>   DW_AT_decl_file   : 22
    <d5a>   DW_AT_decl_line   : 2206
    <d5c>   DW_AT_decl_column : 11
    <d5d>   DW_AT_type        : <0x893d>
    <d61>   DW_AT_data_member_location: 248
 <2><d62>: Abbrev Number: 5 (DW_TAG_member)
    <d63>   DW_AT_name        : (indirect string, offset: 0x1439): fadvise
    <d67>   DW_AT_decl_file   : 22
    <d68>   DW_AT_decl_line   : 2209
    <d6a>   DW_AT_decl_column : 8
    <d6b>   DW_AT_type        : <0x87bb>
    <d6f>   DW_AT_data_member_location: 256
 <2><d71>: Abbrev Number: 5 (DW_TAG_member)
    <d72>   DW_AT_name        : (indirect string, offset: 0x3786): uring_cmd
    <d76>   DW_AT_decl_file   : 22
    <d77>   DW_AT_decl_line   : 2210
    <d79>   DW_AT_decl_column : 8
    <d7a>   DW_AT_type        : <0x8960>
    <d7e>   DW_AT_data_member_location: 264
 <2><d80>: Abbrev Number: 5 (DW_TAG_member)
    <d81>   DW_AT_name        : (indirect string, offset: 0x26dc): uring_cmd_iopoll
    <d85>   DW_AT_decl_file   : 22
    <d86>   DW_AT_decl_line   : 2211
    <d88>   DW_AT_decl_column : 8
    <d89>   DW_AT_type        : <0x897e>
    <d8d>   DW_AT_data_member_location: 272
 <2><d8f>: Abbrev Number: 0
 <1><d90>: Abbrev Number: 14 (DW_TAG_const_type)
    <d91>   DW_AT_type        : <0xb94>
 <1><d95>: Abbrev Number: 8 (DW_TAG_structure_type)
    <d96>   DW_AT_name        : (indirect string, offset: 0xf31): bug_entry
    <d9a>   DW_AT_byte_size   : 12
    <d9b>   DW_AT_decl_file   : 31
    <d9c>   DW_AT_decl_line   : 33
    <d9d>   DW_AT_decl_column : 8
    <d9e>   DW_AT_sibling     : <0xdd7>
 <2><da2>: Abbrev Number: 1 (DW_TAG_member)
    <da3>   DW_AT_name        : (indirect string, offset: 0x95): bug_addr_disp
    <da7>   DW_AT_decl_file   : 31
    <da8>   DW_AT_decl_line   : 37
    <da9>   DW_AT_decl_column : 13
    <daa>   DW_AT_type        : <0xb9>
    <dae>   DW_AT_data_member_location: 0
 <2><daf>: Abbrev Number: 1 (DW_TAG_member)
    <db0>   DW_AT_name        : (indirect string, offset: 0x4061): file_disp
    <db4>   DW_AT_decl_file   : 31
    <db5>   DW_AT_decl_line   : 43
    <db6>   DW_AT_decl_column : 13
    <db7>   DW_AT_type        : <0xb9>
    <dbb>   DW_AT_data_member_location: 4
 <2><dbc>: Abbrev Number: 1 (DW_TAG_member)
    <dbd>   DW_AT_name        : (indirect string, offset: 0x6e): line
    <dc1>   DW_AT_decl_file   : 31
    <dc2>   DW_AT_decl_line   : 45
    <dc3>   DW_AT_decl_column : 17
    <dc4>   DW_AT_type        : <0xa6>
    <dc8>   DW_AT_data_member_location: 8
 <2><dc9>: Abbrev Number: 1 (DW_TAG_member)
    <dca>   DW_AT_name        : (indirect string, offset: 0x6a16): flags
    <dce>   DW_AT_decl_file   : 31
    <dcf>   DW_AT_decl_line   : 47
    <dd0>   DW_AT_decl_column : 17
    <dd1>   DW_AT_type        : <0xa6>
    <dd5>   DW_AT_data_member_location: 10
 <2><dd6>: Abbrev Number: 0
 <1><dd7>: Abbrev Number: 11 (DW_TAG_typedef)
    <dd8>   DW_AT_name        : (indirect string, offset: 0x32e4): time64_t
    <ddc>   DW_AT_decl_file   : 32
    <ddd>   DW_AT_decl_line   : 8
    <dde>   DW_AT_decl_column : 15
    <ddf>   DW_AT_type        : <0xd1>
 <1><de3>: Abbrev Number: 8 (DW_TAG_structure_type)
    <de4>   DW_AT_name        : (indirect string, offset: 0x68c3): __kernel_timespec
    <de8>   DW_AT_byte_size   : 16
    <de9>   DW_AT_decl_file   : 33
    <dea>   DW_AT_decl_line   : 7
    <deb>   DW_AT_decl_column : 8
    <dec>   DW_AT_sibling     : <0xe0b>
 <2><df0>: Abbrev Number: 1 (DW_TAG_member)
    <df1>   DW_AT_name        : (indirect string, offset: 0x5f63): tv_sec
    <df5>   DW_AT_decl_file   : 33
    <df6>   DW_AT_decl_line   : 8
    <df7>   DW_AT_decl_column : 26
    <df8>   DW_AT_type        : <0x1cf>
    <dfc>   DW_AT_data_member_location: 0
 <2><dfd>: Abbrev Number: 1 (DW_TAG_member)
    <dfe>   DW_AT_name        : (indirect string, offset: 0x5dc2): tv_nsec
    <e02>   DW_AT_decl_file   : 33
    <e03>   DW_AT_decl_line   : 9
    <e04>   DW_AT_decl_column : 26
    <e05>   DW_AT_type        : <0xdd>
    <e09>   DW_AT_data_member_location: 8
 <2><e0a>: Abbrev Number: 0
 <1><e0b>: Abbrev Number: 8 (DW_TAG_structure_type)
    <e0c>   DW_AT_name        : (indirect string, offset: 0x1a89): timespec64
    <e10>   DW_AT_byte_size   : 16
    <e11>   DW_AT_decl_file   : 32
    <e12>   DW_AT_decl_line   : 13
    <e13>   DW_AT_decl_column : 8
    <e14>   DW_AT_sibling     : <0xe33>
 <2><e18>: Abbrev Number: 1 (DW_TAG_member)
    <e19>   DW_AT_name        : (indirect string, offset: 0x5f63): tv_sec
    <e1d>   DW_AT_decl_file   : 32
    <e1e>   DW_AT_decl_line   : 14
    <e1f>   DW_AT_decl_column : 11
    <e20>   DW_AT_type        : <0xdd7>
    <e24>   DW_AT_data_member_location: 0
 <2><e25>: Abbrev Number: 1 (DW_TAG_member)
    <e26>   DW_AT_name        : (indirect string, offset: 0x5dc2): tv_nsec
    <e2a>   DW_AT_decl_file   : 32
    <e2b>   DW_AT_decl_line   : 15
    <e2c>   DW_AT_decl_column : 8
    <e2d>   DW_AT_type        : <0x174>
    <e31>   DW_AT_data_member_location: 8
 <2><e32>: Abbrev Number: 0
 <1><e33>: Abbrev Number: 8 (DW_TAG_structure_type)
    <e34>   DW_AT_name        : (indirect string, offset: 0x2d2a): static_call_key
    <e38>   DW_AT_byte_size   : 8
    <e39>   DW_AT_decl_file   : 34
    <e3a>   DW_AT_decl_line   : 94
    <e3b>   DW_AT_decl_column : 8
    <e3c>   DW_AT_sibling     : <0xe4e>
 <2><e40>: Abbrev Number: 1 (DW_TAG_member)
    <e41>   DW_AT_name        : (indirect string, offset: 0x2031): func
    <e45>   DW_AT_decl_file   : 34
    <e46>   DW_AT_decl_line   : 95
    <e47>   DW_AT_decl_column : 8
    <e48>   DW_AT_type        : <0x414>
    <e4c>   DW_AT_data_member_location: 0
 <2><e4d>: Abbrev Number: 0
 <1><e4e>: Abbrev Number: 8 (DW_TAG_structure_type)
    <e4f>   DW_AT_name        : (indirect string, offset: 0x6b23): cpumask
    <e53>   DW_AT_byte_size   : 8
    <e54>   DW_AT_decl_file   : 35
    <e55>   DW_AT_decl_line   : 19
    <e56>   DW_AT_decl_column : 16
    <e57>   DW_AT_sibling     : <0xe69>
 <2><e5b>: Abbrev Number: 1 (DW_TAG_member)
    <e5c>   DW_AT_name        : (indirect string, offset: 0x5262): bits
    <e60>   DW_AT_decl_file   : 35
    <e61>   DW_AT_decl_line   : 19
    <e62>   DW_AT_decl_column : 26
    <e63>   DW_AT_type        : <0xe69>
    <e67>   DW_AT_data_member_location: 0
 <2><e68>: Abbrev Number: 0
 <1><e69>: Abbrev Number: 17 (DW_TAG_array_type)
    <e6a>   DW_AT_type        : <0x2a>
    <e6e>   DW_AT_sibling     : <0xe79>
 <2><e72>: Abbrev Number: 18 (DW_TAG_subrange_type)
    <e73>   DW_AT_type        : <0x2a>
    <e77>   DW_AT_upper_bound : 0
 <2><e78>: Abbrev Number: 0
 <1><e79>: Abbrev Number: 11 (DW_TAG_typedef)
    <e7a>   DW_AT_name        : (indirect string, offset: 0x7618): cpumask_t
    <e7e>   DW_AT_decl_file   : 35
    <e7f>   DW_AT_decl_line   : 19
    <e80>   DW_AT_decl_column : 59
    <e81>   DW_AT_type        : <0xe4e>
 <1><e85>: Abbrev Number: 14 (DW_TAG_const_type)
    <e86>   DW_AT_type        : <0xe79>
 <1><e8a>: Abbrev Number: 8 (DW_TAG_structure_type)
    <e8b>   DW_AT_name        : (indirect string, offset: 0x115f): llist_head
    <e8f>   DW_AT_byte_size   : 8
    <e90>   DW_AT_decl_file   : 36
    <e91>   DW_AT_decl_line   : 56
    <e92>   DW_AT_decl_column : 8
    <e93>   DW_AT_sibling     : <0xea5>
 <2><e97>: Abbrev Number: 1 (DW_TAG_member)
    <e98>   DW_AT_name        : (indirect string, offset: 0xf80): first
    <e9c>   DW_AT_decl_file   : 36
    <e9d>   DW_AT_decl_line   : 57
    <e9e>   DW_AT_decl_column : 21
    <e9f>   DW_AT_type        : <0xec0>
    <ea3>   DW_AT_data_member_location: 0
 <2><ea4>: Abbrev Number: 0
 <1><ea5>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ea6>   DW_AT_name        : (indirect string, offset: 0x74a2): llist_node
    <eaa>   DW_AT_byte_size   : 8
    <eab>   DW_AT_decl_file   : 36
    <eac>   DW_AT_decl_line   : 60
    <ead>   DW_AT_decl_column : 8
    <eae>   DW_AT_sibling     : <0xec0>
 <2><eb2>: Abbrev Number: 1 (DW_TAG_member)
    <eb3>   DW_AT_name        : (indirect string, offset: 0x280d): next
    <eb7>   DW_AT_decl_file   : 36
    <eb8>   DW_AT_decl_line   : 61
    <eb9>   DW_AT_decl_column : 21
    <eba>   DW_AT_type        : <0xec0>
    <ebe>   DW_AT_data_member_location: 0
 <2><ebf>: Abbrev Number: 0
 <1><ec0>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ec1>   DW_AT_byte_size   : 8
    <ec1>   DW_AT_type        : <0xea5>
 <1><ec5>: Abbrev Number: 26 (DW_TAG_union_type)
    <ec6>   DW_AT_byte_size   : 4
    <ec7>   DW_AT_decl_file   : 37
    <ec8>   DW_AT_decl_line   : 60
    <ec9>   DW_AT_decl_column : 2
    <eca>   DW_AT_sibling     : <0xee7>
 <2><ece>: Abbrev Number: 16 (DW_TAG_member)
    <ecf>   DW_AT_name        : (indirect string, offset: 0x6de8): u_flags
    <ed3>   DW_AT_decl_file   : 37
    <ed4>   DW_AT_decl_line   : 61
    <ed5>   DW_AT_decl_column : 16
    <ed6>   DW_AT_type        : <0x5c>
 <2><eda>: Abbrev Number: 16 (DW_TAG_member)
    <edb>   DW_AT_name        : (indirect string, offset: 0x4c3c): a_flags
    <edf>   DW_AT_decl_file   : 37
    <ee0>   DW_AT_decl_line   : 62
    <ee1>   DW_AT_decl_column : 12
    <ee2>   DW_AT_type        : <0x31e>
 <2><ee6>: Abbrev Number: 0
 <1><ee7>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ee8>   DW_AT_name        : (indirect string, offset: 0xef): __call_single_node
    <eec>   DW_AT_byte_size   : 16
    <eed>   DW_AT_decl_file   : 37
    <eee>   DW_AT_decl_line   : 58
    <eef>   DW_AT_decl_column : 8
    <ef0>   DW_AT_sibling     : <0xf22>
 <2><ef4>: Abbrev Number: 1 (DW_TAG_member)
    <ef5>   DW_AT_name        : (indirect string, offset: 0x2126): llist
    <ef9>   DW_AT_decl_file   : 37
    <efa>   DW_AT_decl_line   : 59
    <efb>   DW_AT_decl_column : 20
    <efc>   DW_AT_type        : <0xea5>
    <f00>   DW_AT_data_member_location: 0
 <2><f01>: Abbrev Number: 25 (DW_TAG_member)
    <f02>   DW_AT_type        : <0xec5>
    <f06>   DW_AT_data_member_location: 8
 <2><f07>: Abbrev Number: 9 (DW_TAG_member)
    <f08>   DW_AT_name        : src
    <f0c>   DW_AT_decl_file   : 37
    <f0d>   DW_AT_decl_line   : 65
    <f0e>   DW_AT_decl_column : 6
    <f0f>   DW_AT_type        : <0x109>
    <f13>   DW_AT_data_member_location: 12
 <2><f14>: Abbrev Number: 9 (DW_TAG_member)
    <f15>   DW_AT_name        : dst
    <f19>   DW_AT_decl_file   : 37
    <f1a>   DW_AT_decl_line   : 65
    <f1b>   DW_AT_decl_column : 11
    <f1c>   DW_AT_type        : <0x109>
    <f20>   DW_AT_data_member_location: 14
 <2><f21>: Abbrev Number: 0
 <1><f22>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f23>   DW_AT_byte_size   : 8
    <f23>   DW_AT_type        : <0xf27>
 <1><f27>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <f28>   DW_AT_prototyped  : 1
    <f28>   DW_AT_sibling     : <0xf32>
 <2><f2c>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <f2d>   DW_AT_type        : <0x414>
 <2><f31>: Abbrev Number: 0
 <1><f32>: Abbrev Number: 33 (DW_TAG_enumeration_type)
    <f33>   DW_AT_name        : (indirect string, offset: 0x5e77): timespec_type
    <f37>   DW_AT_encoding    : 7	(unsigned)
    <f37>   DW_AT_byte_size   : 4
    <f37>   DW_AT_type        : <0x5c>
    <f3b>   DW_AT_decl_file   : 38
    <f3c>   DW_AT_decl_line   : 16
    <f3d>   DW_AT_decl_column : 6
    <f3e>   DW_AT_sibling     : <0xf55>
 <2><f42>: Abbrev Number: 6 (DW_TAG_enumerator)
    <f43>   DW_AT_name        : (indirect string, offset: 0x4708): TT_NONE
    <f47>   DW_AT_const_value : 0
 <2><f48>: Abbrev Number: 6 (DW_TAG_enumerator)
    <f49>   DW_AT_name        : (indirect string, offset: 0x33ce): TT_NATIVE
    <f4d>   DW_AT_const_value : 1
 <2><f4e>: Abbrev Number: 6 (DW_TAG_enumerator)
    <f4f>   DW_AT_name        : (indirect string, offset: 0x647c): TT_COMPAT
    <f53>   DW_AT_const_value : 2
 <2><f54>: Abbrev Number: 0
 <1><f55>: Abbrev Number: 20 (DW_TAG_structure_type)
    <f56>   DW_AT_byte_size   : 40
    <f57>   DW_AT_decl_file   : 38
    <f58>   DW_AT_decl_line   : 30
    <f59>   DW_AT_decl_column : 3
    <f5a>   DW_AT_sibling     : <0xfad>
 <2><f5e>: Abbrev Number: 1 (DW_TAG_member)
    <f5f>   DW_AT_name        : (indirect string, offset: 0x6bce): uaddr
    <f63>   DW_AT_decl_file   : 38
    <f64>   DW_AT_decl_line   : 31
    <f65>   DW_AT_decl_column : 16
    <f66>   DW_AT_type        : <0xfad>
    <f6a>   DW_AT_data_member_location: 0
 <2><f6b>: Abbrev Number: 9 (DW_TAG_member)
    <f6c>   DW_AT_name        : val
    <f70>   DW_AT_decl_file   : 38
    <f71>   DW_AT_decl_line   : 32
    <f72>   DW_AT_decl_column : 8
    <f73>   DW_AT_type        : <0x127>
    <f77>   DW_AT_data_member_location: 8
 <2><f78>: Abbrev Number: 1 (DW_TAG_member)
    <f79>   DW_AT_name        : (indirect string, offset: 0x6a16): flags
    <f7d>   DW_AT_decl_file   : 38
    <f7e>   DW_AT_decl_line   : 33
    <f7f>   DW_AT_decl_column : 8
    <f80>   DW_AT_type        : <0x127>
    <f84>   DW_AT_data_member_location: 12
 <2><f85>: Abbrev Number: 1 (DW_TAG_member)
    <f86>   DW_AT_name        : (indirect string, offset: 0x1d53): bitset
    <f8a>   DW_AT_decl_file   : 38
    <f8b>   DW_AT_decl_line   : 34
    <f8c>   DW_AT_decl_column : 8
    <f8d>   DW_AT_type        : <0x127>
    <f91>   DW_AT_data_member_location: 16
 <2><f92>: Abbrev Number: 1 (DW_TAG_member)
    <f93>   DW_AT_name        : (indirect string, offset: 0x5b12): time
    <f97>   DW_AT_decl_file   : 38
    <f98>   DW_AT_decl_line   : 35
    <f99>   DW_AT_decl_column : 8
    <f9a>   DW_AT_type        : <0x13b>
    <f9e>   DW_AT_data_member_location: 24
 <2><f9f>: Abbrev Number: 1 (DW_TAG_member)
    <fa0>   DW_AT_name        : (indirect string, offset: 0x2682): uaddr2
    <fa4>   DW_AT_decl_file   : 38
    <fa5>   DW_AT_decl_line   : 36
    <fa6>   DW_AT_decl_column : 16
    <fa7>   DW_AT_type        : <0xfad>
    <fab>   DW_AT_data_member_location: 32
 <2><fac>: Abbrev Number: 0
 <1><fad>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <fae>   DW_AT_byte_size   : 8
    <fae>   DW_AT_type        : <0x127>
 <1><fb2>: Abbrev Number: 26 (DW_TAG_union_type)
    <fb3>   DW_AT_byte_size   : 8
    <fb4>   DW_AT_decl_file   : 38
    <fb5>   DW_AT_decl_line   : 42
    <fb6>   DW_AT_decl_column : 4
    <fb7>   DW_AT_sibling     : <0xfd4>
 <2><fbb>: Abbrev Number: 16 (DW_TAG_member)
    <fbc>   DW_AT_name        : (indirect string, offset: 0x433c): rmtp
    <fc0>   DW_AT_decl_file   : 38
    <fc1>   DW_AT_decl_line   : 43
    <fc2>   DW_AT_decl_column : 38
    <fc3>   DW_AT_type        : <0xfd4>
 <2><fc7>: Abbrev Number: 16 (DW_TAG_member)
    <fc8>   DW_AT_name        : (indirect string, offset: 0x2455): compat_rmtp
    <fcc>   DW_AT_decl_file   : 38
    <fcd>   DW_AT_decl_line   : 44
    <fce>   DW_AT_decl_column : 35
    <fcf>   DW_AT_type        : <0x1001>
 <2><fd3>: Abbrev Number: 0
 <1><fd4>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <fd5>   DW_AT_byte_size   : 8
    <fd5>   DW_AT_type        : <0xde3>
 <1><fd9>: Abbrev Number: 8 (DW_TAG_structure_type)
    <fda>   DW_AT_name        : (indirect string, offset: 0x5efb): old_timespec32
    <fde>   DW_AT_byte_size   : 8
    <fdf>   DW_AT_decl_file   : 39
    <fe0>   DW_AT_decl_line   : 7
    <fe1>   DW_AT_decl_column : 8
    <fe2>   DW_AT_sibling     : <0x1001>
 <2><fe6>: Abbrev Number: 1 (DW_TAG_member)
    <fe7>   DW_AT_name        : (indirect string, offset: 0x5f63): tv_sec
    <feb>   DW_AT_decl_file   : 39
    <fec>   DW_AT_decl_line   : 8
    <fed>   DW_AT_decl_column : 15
    <fee>   DW_AT_type        : <0x1dc2>
    <ff2>   DW_AT_data_member_location: 0
 <2><ff3>: Abbrev Number: 1 (DW_TAG_member)
    <ff4>   DW_AT_name        : (indirect string, offset: 0x5dc2): tv_nsec
    <ff8>   DW_AT_decl_file   : 39
    <ff9>   DW_AT_decl_line   : 9
    <ffa>   DW_AT_decl_column : 7
    <ffb>   DW_AT_type        : <0x118>
    <fff>   DW_AT_data_member_location: 4
 <2><1000>: Abbrev Number: 0
 <1><1001>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <1002>   DW_AT_byte_size   : 8
    <1002>   DW_AT_type        : <0xfd9>
 <1><1006>: Abbrev Number: 20 (DW_TAG_structure_type)
    <1007>   DW_AT_byte_size   : 24
    <1008>   DW_AT_decl_file   : 38
    <1009>   DW_AT_decl_line   : 39
    <100a>   DW_AT_decl_column : 3
    <100b>   DW_AT_sibling     : <0x103d>
 <2><100f>: Abbrev Number: 1 (DW_TAG_member)
    <1010>   DW_AT_name        : (indirect string, offset: 0x6ec6): clockid
    <1014>   DW_AT_decl_file   : 38
    <1015>   DW_AT_decl_line   : 40
    <1016>   DW_AT_decl_column : 14
    <1017>   DW_AT_type        : <0x24c>
    <101b>   DW_AT_data_member_location: 0
 <2><101c>: Abbrev Number: 1 (DW_TAG_member)
    <101d>   DW_AT_name        : (indirect string, offset: 0x40a6): type
    <1021>   DW_AT_decl_file   : 38
    <1022>   DW_AT_decl_line   : 41
    <1023>   DW_AT_decl_column : 23
    <1024>   DW_AT_type        : <0xf32>
    <1028>   DW_AT_data_member_location: 4
 <2><1029>: Abbrev Number: 25 (DW_TAG_member)
    <102a>   DW_AT_type        : <0xfb2>
    <102e>   DW_AT_data_member_location: 8
 <2><102f>: Abbrev Number: 1 (DW_TAG_member)
    <1030>   DW_AT_name        : (indirect string, offset: 0x5e42): expires
    <1034>   DW_AT_decl_file   : 38
    <1035>   DW_AT_decl_line   : 46
    <1036>   DW_AT_decl_column : 8
    <1037>   DW_AT_type        : <0x13b>
    <103b>   DW_AT_data_member_location: 16
 <2><103c>: Abbrev Number: 0
 <1><103d>: Abbrev Number: 20 (DW_TAG_structure_type)
    <103e>   DW_AT_byte_size   : 32
    <103f>   DW_AT_decl_file   : 38
    <1040>   DW_AT_decl_line   : 49
    <1041>   DW_AT_decl_column : 3
    <1042>   DW_AT_sibling     : <0x1088>
 <2><1046>: Abbrev Number: 1 (DW_TAG_member)
    <1047>   DW_AT_name        : (indirect string, offset: 0x5b4d): ufds
    <104b>   DW_AT_decl_file   : 38
    <104c>   DW_AT_decl_line   : 50
    <104d>   DW_AT_decl_column : 26
    <104e>   DW_AT_type        : <0x10bc>
    <1052>   DW_AT_data_member_location: 0
 <2><1053>: Abbrev Number: 1 (DW_TAG_member)
    <1054>   DW_AT_name        : (indirect string, offset: 0x587d): nfds
    <1058>   DW_AT_decl_file   : 38
    <1059>   DW_AT_decl_line   : 51
    <105a>   DW_AT_decl_column : 8
    <105b>   DW_AT_type        : <0xb9>
    <105f>   DW_AT_data_member_location: 8
 <2><1060>: Abbrev Number: 1 (DW_TAG_member)
    <1061>   DW_AT_name        : (indirect string, offset: 0x3b2): has_timeout
    <1065>   DW_AT_decl_file   : 38
    <1066>   DW_AT_decl_line   : 52
    <1067>   DW_AT_decl_column : 8
    <1068>   DW_AT_type        : <0xb9>
    <106c>   DW_AT_data_member_location: 12
 <2><106d>: Abbrev Number: 1 (DW_TAG_member)
    <106e>   DW_AT_name        : (indirect string, offset: 0x5f63): tv_sec
    <1072>   DW_AT_decl_file   : 38
    <1073>   DW_AT_decl_line   : 53
    <1074>   DW_AT_decl_column : 18
    <1075>   DW_AT_type        : <0x2a>
    <1079>   DW_AT_data_member_location: 16
 <2><107a>: Abbrev Number: 1 (DW_TAG_member)
    <107b>   DW_AT_name        : (indirect string, offset: 0x5dc2): tv_nsec
    <107f>   DW_AT_decl_file   : 38
    <1080>   DW_AT_decl_line   : 54
    <1081>   DW_AT_decl_column : 18
    <1082>   DW_AT_type        : <0x2a>
    <1086>   DW_AT_data_member_location: 24
 <2><1087>: Abbrev Number: 0
 <1><1088>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1089>   DW_AT_name        : (indirect string, offset: 0x7433): pollfd
    <108d>   DW_AT_byte_size   : 8
    <108e>   DW_AT_decl_file   : 40
    <108f>   DW_AT_decl_line   : 36
    <1090>   DW_AT_decl_column : 8
    <1091>   DW_AT_sibling     : <0x10bc>
 <2><1095>: Abbrev Number: 9 (DW_TAG_member)
    <1096>   DW_AT_name        : fd
    <1099>   DW_AT_decl_file   : 40
    <109a>   DW_AT_decl_line   : 37
    <109b>   DW_AT_decl_column : 6
    <109c>   DW_AT_type        : <0xb9>
    <10a0>   DW_AT_data_member_location: 0
 <2><10a1>: Abbrev Number: 1 (DW_TAG_member)
    <10a2>   DW_AT_name        : (indirect string, offset: 0x6086): events
    <10a6>   DW_AT_decl_file   : 40
    <10a7>   DW_AT_decl_line   : 38
    <10a8>   DW_AT_decl_column : 8
    <10a9>   DW_AT_type        : <0x93>
    <10ad>   DW_AT_data_member_location: 4
 <2><10ae>: Abbrev Number: 1 (DW_TAG_member)
    <10af>   DW_AT_name        : (indirect string, offset: 0x562e): revents
    <10b3>   DW_AT_decl_file   : 40
    <10b4>   DW_AT_decl_line   : 39
    <10b5>   DW_AT_decl_column : 8
    <10b6>   DW_AT_type        : <0x93>
    <10ba>   DW_AT_data_member_location: 6
 <2><10bb>: Abbrev Number: 0
 <1><10bc>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <10bd>   DW_AT_byte_size   : 8
    <10bd>   DW_AT_type        : <0x1088>
 <1><10c1>: Abbrev Number: 26 (DW_TAG_union_type)
    <10c2>   DW_AT_byte_size   : 40
    <10c3>   DW_AT_decl_file   : 38
    <10c4>   DW_AT_decl_line   : 28
    <10c5>   DW_AT_decl_column : 2
    <10c6>   DW_AT_sibling     : <0x10ef>
 <2><10ca>: Abbrev Number: 16 (DW_TAG_member)
    <10cb>   DW_AT_name        : (indirect string, offset: 0x5abd): futex
    <10cf>   DW_AT_decl_file   : 38
    <10d0>   DW_AT_decl_line   : 37
    <10d1>   DW_AT_decl_column : 5
    <10d2>   DW_AT_type        : <0xf55>
 <2><10d6>: Abbrev Number: 16 (DW_TAG_member)
    <10d7>   DW_AT_name        : (indirect string, offset: 0x6df): nanosleep
    <10db>   DW_AT_decl_file   : 38
    <10dc>   DW_AT_decl_line   : 47
    <10dd>   DW_AT_decl_column : 5
    <10de>   DW_AT_type        : <0x1006>
 <2><10e2>: Abbrev Number: 16 (DW_TAG_member)
    <10e3>   DW_AT_name        : (indirect string, offset: 0x121b): poll
    <10e7>   DW_AT_decl_file   : 38
    <10e8>   DW_AT_decl_line   : 55
    <10e9>   DW_AT_decl_column : 5
    <10ea>   DW_AT_type        : <0x103d>
 <2><10ee>: Abbrev Number: 0
 <1><10ef>: Abbrev Number: 8 (DW_TAG_structure_type)
    <10f0>   DW_AT_name        : (indirect string, offset: 0x2d4): restart_block
    <10f4>   DW_AT_byte_size   : 56
    <10f5>   DW_AT_decl_file   : 38
    <10f6>   DW_AT_decl_line   : 25
    <10f7>   DW_AT_decl_column : 8
    <10f8>   DW_AT_sibling     : <0x111c>
 <2><10fc>: Abbrev Number: 1 (DW_TAG_member)
    <10fd>   DW_AT_name        : (indirect string, offset: 0x22af): arch_data
    <1101>   DW_AT_decl_file   : 38
    <1102>   DW_AT_decl_line   : 26
    <1103>   DW_AT_decl_column : 16
    <1104>   DW_AT_type        : <0x2a>
    <1108>   DW_AT_data_member_location: 0
 <2><1109>: Abbrev Number: 9 (DW_TAG_member)
    <110a>   DW_AT_name        : fn
    <110d>   DW_AT_decl_file   : 38
    <110e>   DW_AT_decl_line   : 27
    <110f>   DW_AT_decl_column : 9
    <1110>   DW_AT_type        : <0x1130>
    <1114>   DW_AT_data_member_location: 8
 <2><1115>: Abbrev Number: 25 (DW_TAG_member)
    <1116>   DW_AT_type        : <0x10c1>
    <111a>   DW_AT_data_member_location: 16
 <2><111b>: Abbrev Number: 0
 <1><111c>: Abbrev Number: 7 (DW_TAG_subroutine_type)
    <111d>   DW_AT_prototyped  : 1
    <111d>   DW_AT_type        : <0x174>
    <1121>   DW_AT_sibling     : <0x112b>
 <2><1125>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <1126>   DW_AT_type        : <0x112b>
 <2><112a>: Abbrev Number: 0
 <1><112b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <112c>   DW_AT_byte_size   : 8
    <112c>   DW_AT_type        : <0x10ef>
 <1><1130>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <1131>   DW_AT_byte_size   : 8
    <1131>   DW_AT_type        : <0x111c>
 <1><1135>: Abbrev Number: 127 (DW_TAG_variable)
    <1136>   DW_AT_name        : (indirect string, offset: 0x4303): current_stack_pointer
    <113a>   DW_AT_decl_file   : 41
    <113b>   DW_AT_decl_line   : 8
    <113c>   DW_AT_decl_column : 24
    <113d>   DW_AT_type        : <0x2a>
    <1141>   DW_AT_external    : 1
    <1141>   DW_AT_location    : 1 byte block: 6f 	(DW_OP_reg31 (sp))
 <1><1143>: Abbrev Number: 20 (DW_TAG_structure_type)
    <1144>   DW_AT_byte_size   : 8
    <1145>   DW_AT_decl_file   : 42
    <1146>   DW_AT_decl_line   : 31
    <1147>   DW_AT_decl_column : 3
    <1148>   DW_AT_sibling     : <0x1167>
 <2><114c>: Abbrev Number: 1 (DW_TAG_member)
    <114d>   DW_AT_name        : (indirect string, offset: 0x4887): count
    <1151>   DW_AT_decl_file   : 42
    <1152>   DW_AT_decl_line   : 36
    <1153>   DW_AT_decl_column : 8
    <1154>   DW_AT_type        : <0x127>
    <1158>   DW_AT_data_member_location: 0
 <2><1159>: Abbrev Number: 1 (DW_TAG_member)
    <115a>   DW_AT_name        : (indirect string, offset: 0x1200): need_resched
    <115e>   DW_AT_decl_file   : 42
    <115f>   DW_AT_decl_line   : 37
    <1160>   DW_AT_decl_column : 8
    <1161>   DW_AT_type        : <0x127>
    <1165>   DW_AT_data_member_location: 4
 <2><1166>: Abbrev Number: 0
 <1><1167>: Abbrev Number: 26 (DW_TAG_union_type)
    <1168>   DW_AT_byte_size   : 8
    <1169>   DW_AT_decl_file   : 42
    <116a>   DW_AT_decl_line   : 29
    <116b>   DW_AT_decl_column : 2
    <116c>   DW_AT_sibling     : <0x1189>
 <2><1170>: Abbrev Number: 16 (DW_TAG_member)
    <1171>   DW_AT_name        : (indirect string, offset: 0xefa): preempt_count
    <1175>   DW_AT_decl_file   : 42
    <1176>   DW_AT_decl_line   : 30
    <1177>   DW_AT_decl_column : 8
    <1178>   DW_AT_type        : <0x13b>
 <2><117c>: Abbrev Number: 16 (DW_TAG_member)
    <117d>   DW_AT_name        : (indirect string, offset: 0x5993): preempt
    <1181>   DW_AT_decl_file   : 42
    <1182>   DW_AT_decl_line   : 39
    <1183>   DW_AT_decl_column : 5
    <1184>   DW_AT_type        : <0x1143>
 <2><1188>: Abbrev Number: 0
 <1><1189>: Abbrev Number: 8 (DW_TAG_structure_type)
    <118a>   DW_AT_name        : (indirect string, offset: 0x39cf): thread_info
    <118e>   DW_AT_byte_size   : 24
    <118f>   DW_AT_decl_file   : 42
    <1190>   DW_AT_decl_line   : 24
    <1191>   DW_AT_decl_column : 8
    <1192>   DW_AT_sibling     : <0x11b7>
 <2><1196>: Abbrev Number: 1 (DW_TAG_member)
    <1197>   DW_AT_name        : (indirect string, offset: 0x6a16): flags
    <119b>   DW_AT_decl_file   : 42
    <119c>   DW_AT_decl_line   : 25
    <119d>   DW_AT_decl_column : 17
    <119e>   DW_AT_type        : <0x2a>
    <11a2>   DW_AT_data_member_location: 0
 <2><11a3>: Abbrev Number: 25 (DW_TAG_member)
    <11a4>   DW_AT_type        : <0x1167>
    <11a8>   DW_AT_data_member_location: 8
 <2><11a9>: Abbrev Number: 9 (DW_TAG_member)
    <11aa>   DW_AT_name        : cpu
    <11ae>   DW_AT_decl_file   : 42
    <11af>   DW_AT_decl_line   : 45
    <11b0>   DW_AT_decl_column : 8
    <11b1>   DW_AT_type        : <0x127>
    <11b5>   DW_AT_data_member_location: 16
 <2><11b6>: Abbrev Number: 0
 <1><11b7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <11b8>   DW_AT_byte_size   : 8
    <11b8>   DW_AT_type        : <0x11bc>
 <1><11bc>: Abbrev Number: 44 (DW_TAG_structure_type)
    <11bd>   DW_AT_name        : (indirect string, offset: 0x6d79): task_struct
    <11c1>   DW_AT_byte_size   : 4096
    <11c3>   DW_AT_alignment   : 64
    <11c4>   DW_AT_decl_file   : 43
    <11c5>   DW_AT_decl_line   : 737
    <11c7>   DW_AT_decl_column : 8
    <11c7>   DW_AT_sibling     : <0x1db2>
 <2><11cb>: Abbrev Number: 2 (DW_TAG_member)
    <11cc>   DW_AT_name        : (indirect string, offset: 0x39cf): thread_info
    <11d0>   DW_AT_decl_file   : 43
    <11d1>   DW_AT_decl_line   : 743
    <11d3>   DW_AT_decl_column : 22
    <11d4>   DW_AT_type        : <0x1189>
    <11d8>   DW_AT_data_member_location: 0
 <2><11d9>: Abbrev Number: 2 (DW_TAG_member)
    <11da>   DW_AT_name        : (indirect string, offset: 0x4fe1): __state
    <11de>   DW_AT_decl_file   : 43
    <11df>   DW_AT_decl_line   : 745
    <11e1>   DW_AT_decl_column : 17
    <11e2>   DW_AT_type        : <0x5c>
    <11e6>   DW_AT_data_member_location: 24
 <2><11e7>: Abbrev Number: 2 (DW_TAG_member)
    <11e8>   DW_AT_name        : (indirect string, offset: 0x4818): stack
    <11ec>   DW_AT_decl_file   : 43
    <11ed>   DW_AT_decl_line   : 758
    <11ef>   DW_AT_decl_column : 11
    <11f0>   DW_AT_type        : <0x414>
    <11f4>   DW_AT_data_member_location: 32
 <2><11f5>: Abbrev Number: 2 (DW_TAG_member)
    <11f6>   DW_AT_name        : (indirect string, offset: 0x18e8): usage
    <11fa>   DW_AT_decl_file   : 43
    <11fb>   DW_AT_decl_line   : 759
    <11fd>   DW_AT_decl_column : 15
    <11fe>   DW_AT_type        : <0x23f7>
    <1202>   DW_AT_data_member_location: 40
 <2><1203>: Abbrev Number: 2 (DW_TAG_member)
    <1204>   DW_AT_name        : (indirect string, offset: 0x6a16): flags
    <1208>   DW_AT_decl_file   : 43
    <1209>   DW_AT_decl_line   : 761
    <120b>   DW_AT_decl_column : 17
    <120c>   DW_AT_type        : <0x5c>
    <1210>   DW_AT_data_member_location: 44
 <2><1211>: Abbrev Number: 2 (DW_TAG_member)
    <1212>   DW_AT_name        : (indirect string, offset: 0x7793): ptrace
    <1216>   DW_AT_decl_file   : 43
    <1217>   DW_AT_decl_line   : 762
    <1219>   DW_AT_decl_column : 17
    <121a>   DW_AT_type        : <0x5c>
    <121e>   DW_AT_data_member_location: 48
 <2><121f>: Abbrev Number: 2 (DW_TAG_member)
    <1220>   DW_AT_name        : (indirect string, offset: 0x241b): on_cpu
    <1224>   DW_AT_decl_file   : 43
    <1225>   DW_AT_decl_line   : 765
    <1227>   DW_AT_decl_column : 9
    <1228>   DW_AT_type        : <0xb9>
    <122c>   DW_AT_data_member_location: 52
 <2><122d>: Abbrev Number: 2 (DW_TAG_member)
    <122e>   DW_AT_name        : (indirect string, offset: 0x4d84): wake_entry
    <1232>   DW_AT_decl_file   : 43
    <1233>   DW_AT_decl_line   : 766
    <1235>   DW_AT_decl_column : 28
    <1236>   DW_AT_type        : <0xee7>
    <123a>   DW_AT_data_member_location: 56
 <2><123b>: Abbrev Number: 2 (DW_TAG_member)
    <123c>   DW_AT_name        : (indirect string, offset: 0x1b75): wakee_flips
    <1240>   DW_AT_decl_file   : 43
    <1241>   DW_AT_decl_line   : 767
    <1243>   DW_AT_decl_column : 17
    <1244>   DW_AT_type        : <0x5c>
    <1248>   DW_AT_data_member_location: 72
 <2><1249>: Abbrev Number: 2 (DW_TAG_member)
    <124a>   DW_AT_name        : (indirect string, offset: 0x6197): wakee_flip_decay_ts
    <124e>   DW_AT_decl_file   : 43
    <124f>   DW_AT_decl_line   : 768
    <1251>   DW_AT_decl_column : 18
    <1252>   DW_AT_type        : <0x2a>
    <1256>   DW_AT_data_member_location: 80
 <2><1257>: Abbrev Number: 2 (DW_TAG_member)
    <1258>   DW_AT_name        : (indirect string, offset: 0x5d23): last_wakee
    <125c>   DW_AT_decl_file   : 43
    <125d>   DW_AT_decl_line   : 769
    <125f>   DW_AT_decl_column : 23
    <1260>   DW_AT_type        : <0x11b7>
    <1264>   DW_AT_data_member_location: 88
 <2><1265>: Abbrev Number: 2 (DW_TAG_member)
    <1266>   DW_AT_name        : (indirect string, offset: 0x18c9): recent_used_cpu
    <126a>   DW_AT_decl_file   : 43
    <126b>   DW_AT_decl_line   : 778
    <126d>   DW_AT_decl_column : 9
    <126e>   DW_AT_type        : <0xb9>
    <1272>   DW_AT_data_member_location: 96
 <2><1273>: Abbrev Number: 2 (DW_TAG_member)
    <1274>   DW_AT_name        : (indirect string, offset: 0x555c): wake_cpu
    <1278>   DW_AT_decl_file   : 43
    <1279>   DW_AT_decl_line   : 779
    <127b>   DW_AT_decl_column : 9
    <127c>   DW_AT_type        : <0xb9>
    <1280>   DW_AT_data_member_location: 100
 <2><1281>: Abbrev Number: 2 (DW_TAG_member)
    <1282>   DW_AT_name        : (indirect string, offset: 0x55b9): on_rq
    <1286>   DW_AT_decl_file   : 43
    <1287>   DW_AT_decl_line   : 781
    <1289>   DW_AT_decl_column : 9
    <128a>   DW_AT_type        : <0xb9>
    <128e>   DW_AT_data_member_location: 104
 <2><128f>: Abbrev Number: 2 (DW_TAG_member)
    <1290>   DW_AT_name        : (indirect string, offset: 0x5f3f): prio
    <1294>   DW_AT_decl_file   : 43
    <1295>   DW_AT_decl_line   : 783
    <1297>   DW_AT_decl_column : 9
    <1298>   DW_AT_type        : <0xb9>
    <129c>   DW_AT_data_member_location: 108
 <2><129d>: Abbrev Number: 2 (DW_TAG_member)
    <129e>   DW_AT_name        : (indirect string, offset: 0xbfb): static_prio
    <12a2>   DW_AT_decl_file   : 43
    <12a3>   DW_AT_decl_line   : 784
    <12a5>   DW_AT_decl_column : 9
    <12a6>   DW_AT_type        : <0xb9>
    <12aa>   DW_AT_data_member_location: 112
 <2><12ab>: Abbrev Number: 2 (DW_TAG_member)
    <12ac>   DW_AT_name        : (indirect string, offset: 0x4bd4): normal_prio
    <12b0>   DW_AT_decl_file   : 43
    <12b1>   DW_AT_decl_line   : 785
    <12b3>   DW_AT_decl_column : 9
    <12b4>   DW_AT_type        : <0xb9>
    <12b8>   DW_AT_data_member_location: 116
 <2><12b9>: Abbrev Number: 2 (DW_TAG_member)
    <12ba>   DW_AT_name        : (indirect string, offset: 0x4d4): rt_priority
    <12be>   DW_AT_decl_file   : 43
    <12bf>   DW_AT_decl_line   : 786
    <12c1>   DW_AT_decl_column : 17
    <12c2>   DW_AT_type        : <0x5c>
    <12c6>   DW_AT_data_member_location: 120
 <2><12c7>: Abbrev Number: 87 (DW_TAG_member)
    <12c8>   DW_AT_name        : se
    <12cb>   DW_AT_decl_file   : 43
    <12cc>   DW_AT_decl_line   : 788
    <12ce>   DW_AT_decl_column : 23
    <12cf>   DW_AT_type        : <0x3995>
    <12d3>   DW_AT_alignment   : 64
    <12d4>   DW_AT_data_member_location: 128
 <2><12d5>: Abbrev Number: 46 (DW_TAG_member)
    <12d6>   DW_AT_name        : rt
    <12d9>   DW_AT_decl_file   : 43
    <12da>   DW_AT_decl_line   : 789
    <12dc>   DW_AT_decl_column : 26
    <12dd>   DW_AT_type        : <0x3a87>
    <12e1>   DW_AT_data_member_location: 384
 <2><12e3>: Abbrev Number: 108 (DW_TAG_member)
    <12e4>   DW_AT_name        : dl
    <12e7>   DW_AT_decl_file   : 43
    <12e8>   DW_AT_decl_line   : 790
    <12ea>   DW_AT_decl_column : 26
    <12eb>   DW_AT_type        : <0x3b31>
    <12ef>   DW_AT_alignment   : 8
    <12ef>   DW_AT_data_member_location: 456
 <2><12f1>: Abbrev Number: 5 (DW_TAG_member)
    <12f2>   DW_AT_name        : (indirect string, offset: 0x4cc4): sched_class
    <12f6>   DW_AT_decl_file   : 43
    <12f7>   DW_AT_decl_line   : 791
    <12f9>   DW_AT_decl_column : 28
    <12fa>   DW_AT_type        : <0x3d65>
    <12fe>   DW_AT_data_member_location: 680
 <2><1300>: Abbrev Number: 5 (DW_TAG_member)
    <1301>   DW_AT_name        : (indirect string, offset: 0x33ae): sched_task_group
    <1305>   DW_AT_decl_file   : 43
    <1306>   DW_AT_decl_line   : 800
    <1308>   DW_AT_decl_column : 22
    <1309>   DW_AT_type        : <0x3d6f>
    <130d>   DW_AT_data_member_location: 688
